espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/hp_sys_clkrst_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** HP_SYS_CLKRST_CLK_EN0_REG register
 *  Reserved
 */
#define HP_SYS_CLKRST_CLK_EN0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x0)
/** HP_SYS_CLKRST_REG_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_CLK_EN_M  (HP_SYS_CLKRST_REG_CLK_EN_V << HP_SYS_CLKRST_REG_CLK_EN_S)
#define HP_SYS_CLKRST_REG_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CLK_EN_S  0

/** HP_SYS_CLKRST_ROOT_CLK_CTRL0_REG register
 *  Reserved
 */
#define HP_SYS_CLKRST_ROOT_CLK_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x4)
/** HP_SYS_CLKRST_REG_CPUICM_DELAY_NUM : R/W; bitpos: [3:0]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_CPUICM_DELAY_NUM    0x0000000FU
#define HP_SYS_CLKRST_REG_CPUICM_DELAY_NUM_M  (HP_SYS_CLKRST_REG_CPUICM_DELAY_NUM_V << HP_SYS_CLKRST_REG_CPUICM_DELAY_NUM_S)
#define HP_SYS_CLKRST_REG_CPUICM_DELAY_NUM_V  0x0000000FU
#define HP_SYS_CLKRST_REG_CPUICM_DELAY_NUM_S  0
/** HP_SYS_CLKRST_REG_SOC_CLK_DIV_UPDATE : WT; bitpos: [4]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_SOC_CLK_DIV_UPDATE    (BIT(4))
#define HP_SYS_CLKRST_REG_SOC_CLK_DIV_UPDATE_M  (HP_SYS_CLKRST_REG_SOC_CLK_DIV_UPDATE_V << HP_SYS_CLKRST_REG_SOC_CLK_DIV_UPDATE_S)
#define HP_SYS_CLKRST_REG_SOC_CLK_DIV_UPDATE_V  0x00000001U
#define HP_SYS_CLKRST_REG_SOC_CLK_DIV_UPDATE_S  4
/** HP_SYS_CLKRST_REG_CPU_CLK_DIV_NUM : R/W; bitpos: [12:5]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_CPU_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_CPU_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_CPU_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_CPU_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_CPU_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_CPU_CLK_DIV_NUM_S  5
/** HP_SYS_CLKRST_REG_CPU_CLK_DIV_NUMERATOR : R/W; bitpos: [20:13]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_CPU_CLK_DIV_NUMERATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_CPU_CLK_DIV_NUMERATOR_M  (HP_SYS_CLKRST_REG_CPU_CLK_DIV_NUMERATOR_V << HP_SYS_CLKRST_REG_CPU_CLK_DIV_NUMERATOR_S)
#define HP_SYS_CLKRST_REG_CPU_CLK_DIV_NUMERATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_CPU_CLK_DIV_NUMERATOR_S  13
/** HP_SYS_CLKRST_REG_CPU_CLK_DIV_DENOMINATOR : R/W; bitpos: [28:21]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_CPU_CLK_DIV_DENOMINATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_CPU_CLK_DIV_DENOMINATOR_M  (HP_SYS_CLKRST_REG_CPU_CLK_DIV_DENOMINATOR_V << HP_SYS_CLKRST_REG_CPU_CLK_DIV_DENOMINATOR_S)
#define HP_SYS_CLKRST_REG_CPU_CLK_DIV_DENOMINATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_CPU_CLK_DIV_DENOMINATOR_S  21

/** HP_SYS_CLKRST_ROOT_CLK_CTRL1_REG register
 *  Reserved
 */
#define HP_SYS_CLKRST_ROOT_CLK_CTRL1_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x8)
/** HP_SYS_CLKRST_REG_MEM_CLK_DIV_NUM : R/W; bitpos: [7:0]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_MEM_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_MEM_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_MEM_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_MEM_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_MEM_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_MEM_CLK_DIV_NUM_S  0
/** HP_SYS_CLKRST_REG_MEM_CLK_DIV_NUMERATOR : R/W; bitpos: [15:8]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_MEM_CLK_DIV_NUMERATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_MEM_CLK_DIV_NUMERATOR_M  (HP_SYS_CLKRST_REG_MEM_CLK_DIV_NUMERATOR_V << HP_SYS_CLKRST_REG_MEM_CLK_DIV_NUMERATOR_S)
#define HP_SYS_CLKRST_REG_MEM_CLK_DIV_NUMERATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_MEM_CLK_DIV_NUMERATOR_S  8
/** HP_SYS_CLKRST_REG_MEM_CLK_DIV_DENOMINATOR : R/W; bitpos: [23:16]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_MEM_CLK_DIV_DENOMINATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_MEM_CLK_DIV_DENOMINATOR_M  (HP_SYS_CLKRST_REG_MEM_CLK_DIV_DENOMINATOR_V << HP_SYS_CLKRST_REG_MEM_CLK_DIV_DENOMINATOR_S)
#define HP_SYS_CLKRST_REG_MEM_CLK_DIV_DENOMINATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_MEM_CLK_DIV_DENOMINATOR_S  16
/** HP_SYS_CLKRST_REG_SYS_CLK_DIV_NUM : R/W; bitpos: [31:24]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_SYS_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_SYS_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_SYS_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_SYS_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_SYS_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_SYS_CLK_DIV_NUM_S  24

/** HP_SYS_CLKRST_ROOT_CLK_CTRL2_REG register
 *  Reserved
 */
#define HP_SYS_CLKRST_ROOT_CLK_CTRL2_REG (DR_REG_HP_SYS_CLKRST_BASE + 0xc)
/** HP_SYS_CLKRST_REG_SYS_CLK_DIV_NUMERATOR : R/W; bitpos: [7:0]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_SYS_CLK_DIV_NUMERATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_SYS_CLK_DIV_NUMERATOR_M  (HP_SYS_CLKRST_REG_SYS_CLK_DIV_NUMERATOR_V << HP_SYS_CLKRST_REG_SYS_CLK_DIV_NUMERATOR_S)
#define HP_SYS_CLKRST_REG_SYS_CLK_DIV_NUMERATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_SYS_CLK_DIV_NUMERATOR_S  0
/** HP_SYS_CLKRST_REG_SYS_CLK_DIV_DENOMINATOR : R/W; bitpos: [15:8]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_SYS_CLK_DIV_DENOMINATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_SYS_CLK_DIV_DENOMINATOR_M  (HP_SYS_CLKRST_REG_SYS_CLK_DIV_DENOMINATOR_V << HP_SYS_CLKRST_REG_SYS_CLK_DIV_DENOMINATOR_S)
#define HP_SYS_CLKRST_REG_SYS_CLK_DIV_DENOMINATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_SYS_CLK_DIV_DENOMINATOR_S  8
/** HP_SYS_CLKRST_REG_APB_CLK_DIV_NUM : R/W; bitpos: [23:16]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_APB_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_APB_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_APB_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_APB_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_APB_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_APB_CLK_DIV_NUM_S  16
/** HP_SYS_CLKRST_REG_APB_CLK_DIV_NUMERATOR : R/W; bitpos: [31:24]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_APB_CLK_DIV_NUMERATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_APB_CLK_DIV_NUMERATOR_M  (HP_SYS_CLKRST_REG_APB_CLK_DIV_NUMERATOR_V << HP_SYS_CLKRST_REG_APB_CLK_DIV_NUMERATOR_S)
#define HP_SYS_CLKRST_REG_APB_CLK_DIV_NUMERATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_APB_CLK_DIV_NUMERATOR_S  24

/** HP_SYS_CLKRST_ROOT_CLK_CTRL3_REG register
 *  Reserved
 */
#define HP_SYS_CLKRST_ROOT_CLK_CTRL3_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x10)
/** HP_SYS_CLKRST_REG_APB_CLK_DIV_DENOMINATOR : R/W; bitpos: [7:0]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_APB_CLK_DIV_DENOMINATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_APB_CLK_DIV_DENOMINATOR_M  (HP_SYS_CLKRST_REG_APB_CLK_DIV_DENOMINATOR_V << HP_SYS_CLKRST_REG_APB_CLK_DIV_DENOMINATOR_S)
#define HP_SYS_CLKRST_REG_APB_CLK_DIV_DENOMINATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_APB_CLK_DIV_DENOMINATOR_S  0

