espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/hp_sys_clkrst_reg.h
/** HP_SYS_CLKRST_SOC_CLK_CTRL1_REG register
 *  Reserved
 */
#define HP_SYS_CLKRST_SOC_CLK_CTRL1_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x18)
/** HP_SYS_CLKRST_REG_GPSPI2_SYS_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_GPSPI2_SYS_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_GPSPI2_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_GPSPI2_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_GPSPI2_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_GPSPI2_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_GPSPI2_SYS_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_GPSPI3_SYS_CLK_EN : R/W; bitpos: [1]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_GPSPI3_SYS_CLK_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_GPSPI3_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_GPSPI3_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_GPSPI3_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_GPSPI3_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_GPSPI3_SYS_CLK_EN_S  1
/** HP_SYS_CLKRST_REG_REGDMA_SYS_CLK_EN : R/W; bitpos: [2]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_REGDMA_SYS_CLK_EN    (BIT(2))
#define HP_SYS_CLKRST_REG_REGDMA_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_REGDMA_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_REGDMA_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_REGDMA_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_REGDMA_SYS_CLK_EN_S  2
/** HP_SYS_CLKRST_REG_AHB_PDMA_SYS_CLK_EN : R/W; bitpos: [3]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_AHB_PDMA_SYS_CLK_EN    (BIT(3))
#define HP_SYS_CLKRST_REG_AHB_PDMA_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_AHB_PDMA_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_AHB_PDMA_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_AHB_PDMA_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_AHB_PDMA_SYS_CLK_EN_S  3
/** HP_SYS_CLKRST_REG_AXI_PDMA_SYS_CLK_EN : R/W; bitpos: [4]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_AXI_PDMA_SYS_CLK_EN    (BIT(4))
#define HP_SYS_CLKRST_REG_AXI_PDMA_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_AXI_PDMA_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_AXI_PDMA_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_AXI_PDMA_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_AXI_PDMA_SYS_CLK_EN_S  4
/** HP_SYS_CLKRST_REG_GDMA_SYS_CLK_EN : R/W; bitpos: [5]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_GDMA_SYS_CLK_EN    (BIT(5))
#define HP_SYS_CLKRST_REG_GDMA_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_GDMA_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_GDMA_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_GDMA_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_GDMA_SYS_CLK_EN_S  5
/** HP_SYS_CLKRST_REG_DMA2D_SYS_CLK_EN : R/W; bitpos: [6]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_DMA2D_SYS_CLK_EN    (BIT(6))
#define HP_SYS_CLKRST_REG_DMA2D_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_DMA2D_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_DMA2D_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_DMA2D_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_DMA2D_SYS_CLK_EN_S  6
/** HP_SYS_CLKRST_REG_VPU_SYS_CLK_EN : R/W; bitpos: [7]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_VPU_SYS_CLK_EN    (BIT(7))
#define HP_SYS_CLKRST_REG_VPU_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_VPU_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_VPU_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_VPU_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_VPU_SYS_CLK_EN_S  7
/** HP_SYS_CLKRST_REG_JPEG_SYS_CLK_EN : R/W; bitpos: [8]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_JPEG_SYS_CLK_EN    (BIT(8))
#define HP_SYS_CLKRST_REG_JPEG_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_JPEG_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_JPEG_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_JPEG_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_JPEG_SYS_CLK_EN_S  8
/** HP_SYS_CLKRST_REG_PPA_SYS_CLK_EN : R/W; bitpos: [9]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_PPA_SYS_CLK_EN    (BIT(9))
#define HP_SYS_CLKRST_REG_PPA_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_PPA_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_PPA_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_PPA_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PPA_SYS_CLK_EN_S  9
/** HP_SYS_CLKRST_REG_CSI_BRG_SYS_CLK_EN : R/W; bitpos: [10]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_CSI_BRG_SYS_CLK_EN    (BIT(10))
#define HP_SYS_CLKRST_REG_CSI_BRG_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_CSI_BRG_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_CSI_BRG_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_CSI_BRG_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CSI_BRG_SYS_CLK_EN_S  10
/** HP_SYS_CLKRST_REG_CSI_HOST_SYS_CLK_EN : R/W; bitpos: [11]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_CSI_HOST_SYS_CLK_EN    (BIT(11))
#define HP_SYS_CLKRST_REG_CSI_HOST_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_CSI_HOST_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_CSI_HOST_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_CSI_HOST_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CSI_HOST_SYS_CLK_EN_S  11
/** HP_SYS_CLKRST_REG_DSI_SYS_CLK_EN : R/W; bitpos: [12]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_DSI_SYS_CLK_EN    (BIT(12))
#define HP_SYS_CLKRST_REG_DSI_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_DSI_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_DSI_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_DSI_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_DSI_SYS_CLK_EN_S  12
/** HP_SYS_CLKRST_REG_EMAC_SYS_CLK_EN : R/W; bitpos: [13]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_EMAC_SYS_CLK_EN    (BIT(13))
#define HP_SYS_CLKRST_REG_EMAC_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_EMAC_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_EMAC_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_EMAC_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_EMAC_SYS_CLK_EN_S  13
/** HP_SYS_CLKRST_REG_SDMMC_SYS_CLK_EN : R/W; bitpos: [14]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_SDMMC_SYS_CLK_EN    (BIT(14))
#define HP_SYS_CLKRST_REG_SDMMC_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_SDMMC_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_SDMMC_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_SDMMC_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_SDMMC_SYS_CLK_EN_S  14
/** HP_SYS_CLKRST_REG_USB_OTG11_SYS_CLK_EN : R/W; bitpos: [15]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_USB_OTG11_SYS_CLK_EN    (BIT(15))
#define HP_SYS_CLKRST_REG_USB_OTG11_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_USB_OTG11_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_USB_OTG11_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_USB_OTG11_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_USB_OTG11_SYS_CLK_EN_S  15
/** HP_SYS_CLKRST_REG_USB_OTG20_SYS_CLK_EN : R/W; bitpos: [16]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_USB_OTG20_SYS_CLK_EN    (BIT(16))
#define HP_SYS_CLKRST_REG_USB_OTG20_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_USB_OTG20_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_USB_OTG20_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_USB_OTG20_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_USB_OTG20_SYS_CLK_EN_S  16
/** HP_SYS_CLKRST_REG_UHCI_SYS_CLK_EN : R/W; bitpos: [17]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_UHCI_SYS_CLK_EN    (BIT(17))
#define HP_SYS_CLKRST_REG_UHCI_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_UHCI_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_UHCI_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_UHCI_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_UHCI_SYS_CLK_EN_S  17
/** HP_SYS_CLKRST_REG_UART0_SYS_CLK_EN : R/W; bitpos: [18]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_UART0_SYS_CLK_EN    (BIT(18))
#define HP_SYS_CLKRST_REG_UART0_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_UART0_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_UART0_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_UART0_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_UART0_SYS_CLK_EN_S  18
/** HP_SYS_CLKRST_REG_UART1_SYS_CLK_EN : R/W; bitpos: [19]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_UART1_SYS_CLK_EN    (BIT(19))
#define HP_SYS_CLKRST_REG_UART1_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_UART1_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_UART1_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_UART1_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_UART1_SYS_CLK_EN_S  19
/** HP_SYS_CLKRST_REG_UART2_SYS_CLK_EN : R/W; bitpos: [20]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_UART2_SYS_CLK_EN    (BIT(20))
#define HP_SYS_CLKRST_REG_UART2_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_UART2_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_UART2_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_UART2_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_UART2_SYS_CLK_EN_S  20
/** HP_SYS_CLKRST_REG_UART3_SYS_CLK_EN : R/W; bitpos: [21]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_UART3_SYS_CLK_EN    (BIT(21))
#define HP_SYS_CLKRST_REG_UART3_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_UART3_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_UART3_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_UART3_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_UART3_SYS_CLK_EN_S  21
/** HP_SYS_CLKRST_REG_UART4_SYS_CLK_EN : R/W; bitpos: [22]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_UART4_SYS_CLK_EN    (BIT(22))
#define HP_SYS_CLKRST_REG_UART4_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_UART4_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_UART4_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_UART4_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_UART4_SYS_CLK_EN_S  22
/** HP_SYS_CLKRST_REG_PARLIO_SYS_CLK_EN : R/W; bitpos: [23]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_PARLIO_SYS_CLK_EN    (BIT(23))
#define HP_SYS_CLKRST_REG_PARLIO_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_PARLIO_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_PARLIO_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_PARLIO_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PARLIO_SYS_CLK_EN_S  23
/** HP_SYS_CLKRST_REG_ETM_SYS_CLK_EN : R/W; bitpos: [24]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_ETM_SYS_CLK_EN    (BIT(24))
#define HP_SYS_CLKRST_REG_ETM_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_ETM_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_ETM_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_ETM_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_ETM_SYS_CLK_EN_S  24
/** HP_SYS_CLKRST_REG_PVT_SYS_CLK_EN : R/W; bitpos: [25]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_PVT_SYS_CLK_EN    (BIT(25))
#define HP_SYS_CLKRST_REG_PVT_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_PVT_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_PVT_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_PVT_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PVT_SYS_CLK_EN_S  25
/** HP_SYS_CLKRST_REG_CRYPTO_SYS_CLK_EN : R/W; bitpos: [26]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_CRYPTO_SYS_CLK_EN    (BIT(26))
#define HP_SYS_CLKRST_REG_CRYPTO_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_CRYPTO_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_CRYPTO_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_CRYPTO_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CRYPTO_SYS_CLK_EN_S  26
/** HP_SYS_CLKRST_REG_KEY_MANAGER_SYS_CLK_EN : R/W; bitpos: [27]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_KEY_MANAGER_SYS_CLK_EN    (BIT(27))
#define HP_SYS_CLKRST_REG_KEY_MANAGER_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_KEY_MANAGER_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_KEY_MANAGER_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_KEY_MANAGER_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_KEY_MANAGER_SYS_CLK_EN_S  27
/** HP_SYS_CLKRST_REG_BITSCRAMBLER_SYS_CLK_EN : R/W; bitpos: [28]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_SYS_CLK_EN    (BIT(28))
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_BITSCRAMBLER_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_BITSCRAMBLER_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_SYS_CLK_EN_S  28
/** HP_SYS_CLKRST_REG_BITSCRAMBLER_RX_SYS_CLK_EN : R/W; bitpos: [29]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_RX_SYS_CLK_EN    (BIT(29))
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_RX_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_BITSCRAMBLER_RX_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_BITSCRAMBLER_RX_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_RX_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_RX_SYS_CLK_EN_S  29
/** HP_SYS_CLKRST_REG_BITSCRAMBLER_TX_SYS_CLK_EN : R/W; bitpos: [30]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_TX_SYS_CLK_EN    (BIT(30))
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_TX_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_BITSCRAMBLER_TX_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_BITSCRAMBLER_TX_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_TX_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_TX_SYS_CLK_EN_S  30
/** HP_SYS_CLKRST_REG_H264_SYS_CLK_EN : R/W; bitpos: [31]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_H264_SYS_CLK_EN    (BIT(31))
#define HP_SYS_CLKRST_REG_H264_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_H264_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_H264_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_H264_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_H264_SYS_CLK_EN_S  31

