espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/hp_sys_clkrst_reg.h
/** HP_SYS_CLKRST_REF_CLK_CTRL2_REG register
 *  Reserved
 */
#define HP_SYS_CLKRST_REF_CLK_CTRL2_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x2c)
/** HP_SYS_CLKRST_REG_REF_160M_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_REF_160M_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_REF_160M_CLK_EN_M  (HP_SYS_CLKRST_REG_REF_160M_CLK_EN_V << HP_SYS_CLKRST_REG_REF_160M_CLK_EN_S)
#define HP_SYS_CLKRST_REG_REF_160M_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_REF_160M_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_TM_160M_CLK_EN : R/W; bitpos: [1]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_TM_160M_CLK_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_TM_160M_CLK_EN_M  (HP_SYS_CLKRST_REG_TM_160M_CLK_EN_V << HP_SYS_CLKRST_REG_TM_160M_CLK_EN_S)
#define HP_SYS_CLKRST_REG_TM_160M_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TM_160M_CLK_EN_S  1
/** HP_SYS_CLKRST_REG_REF_120M_CLK_EN : R/W; bitpos: [2]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_REF_120M_CLK_EN    (BIT(2))
#define HP_SYS_CLKRST_REG_REF_120M_CLK_EN_M  (HP_SYS_CLKRST_REG_REF_120M_CLK_EN_V << HP_SYS_CLKRST_REG_REF_120M_CLK_EN_S)
#define HP_SYS_CLKRST_REG_REF_120M_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_REF_120M_CLK_EN_S  2
/** HP_SYS_CLKRST_REG_TM_120M_CLK_EN : R/W; bitpos: [3]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_TM_120M_CLK_EN    (BIT(3))
#define HP_SYS_CLKRST_REG_TM_120M_CLK_EN_M  (HP_SYS_CLKRST_REG_TM_120M_CLK_EN_V << HP_SYS_CLKRST_REG_TM_120M_CLK_EN_S)
#define HP_SYS_CLKRST_REG_TM_120M_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TM_120M_CLK_EN_S  3
/** HP_SYS_CLKRST_REG_REF_80M_CLK_EN : R/W; bitpos: [4]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_REF_80M_CLK_EN    (BIT(4))
#define HP_SYS_CLKRST_REG_REF_80M_CLK_EN_M  (HP_SYS_CLKRST_REG_REF_80M_CLK_EN_V << HP_SYS_CLKRST_REG_REF_80M_CLK_EN_S)
#define HP_SYS_CLKRST_REG_REF_80M_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_REF_80M_CLK_EN_S  4
/** HP_SYS_CLKRST_REG_TM_80M_CLK_EN : R/W; bitpos: [5]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_TM_80M_CLK_EN    (BIT(5))
#define HP_SYS_CLKRST_REG_TM_80M_CLK_EN_M  (HP_SYS_CLKRST_REG_TM_80M_CLK_EN_V << HP_SYS_CLKRST_REG_TM_80M_CLK_EN_S)
#define HP_SYS_CLKRST_REG_TM_80M_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TM_80M_CLK_EN_S  5
/** HP_SYS_CLKRST_REG_TM_60M_CLK_EN : R/W; bitpos: [6]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_TM_60M_CLK_EN    (BIT(6))
#define HP_SYS_CLKRST_REG_TM_60M_CLK_EN_M  (HP_SYS_CLKRST_REG_TM_60M_CLK_EN_V << HP_SYS_CLKRST_REG_TM_60M_CLK_EN_S)
#define HP_SYS_CLKRST_REG_TM_60M_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TM_60M_CLK_EN_S  6
/** HP_SYS_CLKRST_REG_TM_48M_CLK_EN : R/W; bitpos: [7]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_TM_48M_CLK_EN    (BIT(7))
#define HP_SYS_CLKRST_REG_TM_48M_CLK_EN_M  (HP_SYS_CLKRST_REG_TM_48M_CLK_EN_V << HP_SYS_CLKRST_REG_TM_48M_CLK_EN_S)
#define HP_SYS_CLKRST_REG_TM_48M_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TM_48M_CLK_EN_S  7
/** HP_SYS_CLKRST_REG_REF_20M_CLK_EN : R/W; bitpos: [8]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_REF_20M_CLK_EN    (BIT(8))
#define HP_SYS_CLKRST_REG_REF_20M_CLK_EN_M  (HP_SYS_CLKRST_REG_REF_20M_CLK_EN_V << HP_SYS_CLKRST_REG_REF_20M_CLK_EN_S)
#define HP_SYS_CLKRST_REG_REF_20M_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_REF_20M_CLK_EN_S  8
/** HP_SYS_CLKRST_REG_TM_20M_CLK_EN : R/W; bitpos: [9]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_TM_20M_CLK_EN    (BIT(9))
#define HP_SYS_CLKRST_REG_TM_20M_CLK_EN_M  (HP_SYS_CLKRST_REG_TM_20M_CLK_EN_V << HP_SYS_CLKRST_REG_TM_20M_CLK_EN_S)
#define HP_SYS_CLKRST_REG_TM_20M_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TM_20M_CLK_EN_S  9

/** HP_SYS_CLKRST_PERI_CLK_CTRL00_REG register
 *  Reserved
 */
#define HP_SYS_CLKRST_PERI_CLK_CTRL00_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x30)
/** HP_SYS_CLKRST_REG_FLASH_CLK_SRC_SEL : R/W; bitpos: [1:0]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FLASH_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_FLASH_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_FLASH_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_FLASH_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_FLASH_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_FLASH_CLK_SRC_SEL_S  0
/** HP_SYS_CLKRST_REG_FLASH_PLL_CLK_EN : R/W; bitpos: [2]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FLASH_PLL_CLK_EN    (BIT(2))
#define HP_SYS_CLKRST_REG_FLASH_PLL_CLK_EN_M  (HP_SYS_CLKRST_REG_FLASH_PLL_CLK_EN_V << HP_SYS_CLKRST_REG_FLASH_PLL_CLK_EN_S)
#define HP_SYS_CLKRST_REG_FLASH_PLL_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_FLASH_PLL_CLK_EN_S  2
/** HP_SYS_CLKRST_REG_FLASH_CORE_CLK_EN : R/W; bitpos: [3]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FLASH_CORE_CLK_EN    (BIT(3))
#define HP_SYS_CLKRST_REG_FLASH_CORE_CLK_EN_M  (HP_SYS_CLKRST_REG_FLASH_CORE_CLK_EN_V << HP_SYS_CLKRST_REG_FLASH_CORE_CLK_EN_S)
#define HP_SYS_CLKRST_REG_FLASH_CORE_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_FLASH_CORE_CLK_EN_S  3
/** HP_SYS_CLKRST_REG_FLASH_CORE_CLK_DIV_NUM : R/W; bitpos: [11:4]; default: 3;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FLASH_CORE_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_FLASH_CORE_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_FLASH_CORE_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_FLASH_CORE_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_FLASH_CORE_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_FLASH_CORE_CLK_DIV_NUM_S  4
/** HP_SYS_CLKRST_REG_PSRAM_CLK_SRC_SEL : R/W; bitpos: [13:12]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_PSRAM_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_PSRAM_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_PSRAM_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_PSRAM_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_PSRAM_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_PSRAM_CLK_SRC_SEL_S  12
/** HP_SYS_CLKRST_REG_PSRAM_PLL_CLK_EN : R/W; bitpos: [14]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_PSRAM_PLL_CLK_EN    (BIT(14))
#define HP_SYS_CLKRST_REG_PSRAM_PLL_CLK_EN_M  (HP_SYS_CLKRST_REG_PSRAM_PLL_CLK_EN_V << HP_SYS_CLKRST_REG_PSRAM_PLL_CLK_EN_S)
#define HP_SYS_CLKRST_REG_PSRAM_PLL_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PSRAM_PLL_CLK_EN_S  14
/** HP_SYS_CLKRST_REG_PSRAM_CORE_CLK_EN : R/W; bitpos: [15]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_PSRAM_CORE_CLK_EN    (BIT(15))
#define HP_SYS_CLKRST_REG_PSRAM_CORE_CLK_EN_M  (HP_SYS_CLKRST_REG_PSRAM_CORE_CLK_EN_V << HP_SYS_CLKRST_REG_PSRAM_CORE_CLK_EN_S)
#define HP_SYS_CLKRST_REG_PSRAM_CORE_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PSRAM_CORE_CLK_EN_S  15
/** HP_SYS_CLKRST_REG_PSRAM_CORE_CLK_DIV_NUM : R/W; bitpos: [23:16]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_PSRAM_CORE_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_PSRAM_CORE_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_PSRAM_CORE_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_PSRAM_CORE_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_PSRAM_CORE_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_PSRAM_CORE_CLK_DIV_NUM_S  16
/** HP_SYS_CLKRST_REG_PAD_EMAC_REF_CLK_EN : R/W; bitpos: [24]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_PAD_EMAC_REF_CLK_EN    (BIT(24))
#define HP_SYS_CLKRST_REG_PAD_EMAC_REF_CLK_EN_M  (HP_SYS_CLKRST_REG_PAD_EMAC_REF_CLK_EN_V << HP_SYS_CLKRST_REG_PAD_EMAC_REF_CLK_EN_S)
#define HP_SYS_CLKRST_REG_PAD_EMAC_REF_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PAD_EMAC_REF_CLK_EN_S  24
/** HP_SYS_CLKRST_REG_EMAC_RMII_CLK_SRC_SEL : R/W; bitpos: [26:25]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_EMAC_RMII_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_EMAC_RMII_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_EMAC_RMII_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_EMAC_RMII_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_EMAC_RMII_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_EMAC_RMII_CLK_SRC_SEL_S  25
/** HP_SYS_CLKRST_REG_EMAC_RMII_CLK_EN : R/W; bitpos: [27]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_EMAC_RMII_CLK_EN    (BIT(27))
#define HP_SYS_CLKRST_REG_EMAC_RMII_CLK_EN_M  (HP_SYS_CLKRST_REG_EMAC_RMII_CLK_EN_V << HP_SYS_CLKRST_REG_EMAC_RMII_CLK_EN_S)
#define HP_SYS_CLKRST_REG_EMAC_RMII_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_EMAC_RMII_CLK_EN_S  27
/** HP_SYS_CLKRST_REG_EMAC_RX_CLK_SRC_SEL : R/W; bitpos: [28]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_EMAC_RX_CLK_SRC_SEL    (BIT(28))
#define HP_SYS_CLKRST_REG_EMAC_RX_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_EMAC_RX_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_EMAC_RX_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_EMAC_RX_CLK_SRC_SEL_V  0x00000001U
#define HP_SYS_CLKRST_REG_EMAC_RX_CLK_SRC_SEL_S  28
/** HP_SYS_CLKRST_REG_EMAC_RX_CLK_EN : R/W; bitpos: [29]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_EMAC_RX_CLK_EN    (BIT(29))
#define HP_SYS_CLKRST_REG_EMAC_RX_CLK_EN_M  (HP_SYS_CLKRST_REG_EMAC_RX_CLK_EN_V << HP_SYS_CLKRST_REG_EMAC_RX_CLK_EN_S)
#define HP_SYS_CLKRST_REG_EMAC_RX_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_EMAC_RX_CLK_EN_S  29

