espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/hp_sys_clkrst_reg.h
/** HP_SYS_CLKRST_PERI_CLK_CTRL11_REG register
 *  Reserved
 */
#define HP_SYS_CLKRST_PERI_CLK_CTRL11_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x44)
/** HP_SYS_CLKRST_REG_I2C1_CLK_DIV_NUM : R/W; bitpos: [7:0]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2C1_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_I2C1_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_I2C1_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_I2C1_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_I2C1_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_I2C1_CLK_DIV_NUM_S  0
/** HP_SYS_CLKRST_REG_I2C1_CLK_DIV_NUMERATOR : R/W; bitpos: [15:8]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2C1_CLK_DIV_NUMERATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_I2C1_CLK_DIV_NUMERATOR_M  (HP_SYS_CLKRST_REG_I2C1_CLK_DIV_NUMERATOR_V << HP_SYS_CLKRST_REG_I2C1_CLK_DIV_NUMERATOR_S)
#define HP_SYS_CLKRST_REG_I2C1_CLK_DIV_NUMERATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_I2C1_CLK_DIV_NUMERATOR_S  8
/** HP_SYS_CLKRST_REG_I2C1_CLK_DIV_DENOMINATOR : R/W; bitpos: [23:16]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2C1_CLK_DIV_DENOMINATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_I2C1_CLK_DIV_DENOMINATOR_M  (HP_SYS_CLKRST_REG_I2C1_CLK_DIV_DENOMINATOR_V << HP_SYS_CLKRST_REG_I2C1_CLK_DIV_DENOMINATOR_S)
#define HP_SYS_CLKRST_REG_I2C1_CLK_DIV_DENOMINATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_I2C1_CLK_DIV_DENOMINATOR_S  16
/** HP_SYS_CLKRST_REG_I2S0_RX_CLK_EN : R/W; bitpos: [24]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S0_RX_CLK_EN    (BIT(24))
#define HP_SYS_CLKRST_REG_I2S0_RX_CLK_EN_M  (HP_SYS_CLKRST_REG_I2S0_RX_CLK_EN_V << HP_SYS_CLKRST_REG_I2S0_RX_CLK_EN_S)
#define HP_SYS_CLKRST_REG_I2S0_RX_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_I2S0_RX_CLK_EN_S  24
/** HP_SYS_CLKRST_REG_I2S0_RX_CLK_SRC_SEL : R/W; bitpos: [26:25]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S0_RX_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_I2S0_RX_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_I2S0_RX_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_I2S0_RX_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_I2S0_RX_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_I2S0_RX_CLK_SRC_SEL_S  25

/** HP_SYS_CLKRST_PERI_CLK_CTRL12_REG register
 *  Reserved
 */
#define HP_SYS_CLKRST_PERI_CLK_CTRL12_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x48)
/** HP_SYS_CLKRST_REG_I2S0_RX_DIV_N : R/W; bitpos: [7:0]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S0_RX_DIV_N    0x000000FFU
#define HP_SYS_CLKRST_REG_I2S0_RX_DIV_N_M  (HP_SYS_CLKRST_REG_I2S0_RX_DIV_N_V << HP_SYS_CLKRST_REG_I2S0_RX_DIV_N_S)
#define HP_SYS_CLKRST_REG_I2S0_RX_DIV_N_V  0x000000FFU
#define HP_SYS_CLKRST_REG_I2S0_RX_DIV_N_S  0
/** HP_SYS_CLKRST_REG_I2S0_RX_DIV_X : R/W; bitpos: [16:8]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S0_RX_DIV_X    0x000001FFU
#define HP_SYS_CLKRST_REG_I2S0_RX_DIV_X_M  (HP_SYS_CLKRST_REG_I2S0_RX_DIV_X_V << HP_SYS_CLKRST_REG_I2S0_RX_DIV_X_S)
#define HP_SYS_CLKRST_REG_I2S0_RX_DIV_X_V  0x000001FFU
#define HP_SYS_CLKRST_REG_I2S0_RX_DIV_X_S  8
/** HP_SYS_CLKRST_REG_I2S0_RX_DIV_Y : R/W; bitpos: [25:17]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S0_RX_DIV_Y    0x000001FFU
#define HP_SYS_CLKRST_REG_I2S0_RX_DIV_Y_M  (HP_SYS_CLKRST_REG_I2S0_RX_DIV_Y_V << HP_SYS_CLKRST_REG_I2S0_RX_DIV_Y_S)
#define HP_SYS_CLKRST_REG_I2S0_RX_DIV_Y_V  0x000001FFU
#define HP_SYS_CLKRST_REG_I2S0_RX_DIV_Y_S  17

/** HP_SYS_CLKRST_PERI_CLK_CTRL13_REG register
 *  Reserved
 */
#define HP_SYS_CLKRST_PERI_CLK_CTRL13_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x4c)
/** HP_SYS_CLKRST_REG_I2S0_RX_DIV_Z : R/W; bitpos: [8:0]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S0_RX_DIV_Z    0x000001FFU
#define HP_SYS_CLKRST_REG_I2S0_RX_DIV_Z_M  (HP_SYS_CLKRST_REG_I2S0_RX_DIV_Z_V << HP_SYS_CLKRST_REG_I2S0_RX_DIV_Z_S)
#define HP_SYS_CLKRST_REG_I2S0_RX_DIV_Z_V  0x000001FFU
#define HP_SYS_CLKRST_REG_I2S0_RX_DIV_Z_S  0
/** HP_SYS_CLKRST_REG_I2S0_RX_DIV_YN1 : R/W; bitpos: [9]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S0_RX_DIV_YN1    (BIT(9))
#define HP_SYS_CLKRST_REG_I2S0_RX_DIV_YN1_M  (HP_SYS_CLKRST_REG_I2S0_RX_DIV_YN1_V << HP_SYS_CLKRST_REG_I2S0_RX_DIV_YN1_S)
#define HP_SYS_CLKRST_REG_I2S0_RX_DIV_YN1_V  0x00000001U
#define HP_SYS_CLKRST_REG_I2S0_RX_DIV_YN1_S  9
/** HP_SYS_CLKRST_REG_I2S0_TX_CLK_EN : R/W; bitpos: [10]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S0_TX_CLK_EN    (BIT(10))
#define HP_SYS_CLKRST_REG_I2S0_TX_CLK_EN_M  (HP_SYS_CLKRST_REG_I2S0_TX_CLK_EN_V << HP_SYS_CLKRST_REG_I2S0_TX_CLK_EN_S)
#define HP_SYS_CLKRST_REG_I2S0_TX_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_I2S0_TX_CLK_EN_S  10
/** HP_SYS_CLKRST_REG_I2S0_TX_CLK_SRC_SEL : R/W; bitpos: [12:11]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S0_TX_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_I2S0_TX_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_I2S0_TX_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_I2S0_TX_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_I2S0_TX_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_I2S0_TX_CLK_SRC_SEL_S  11
/** HP_SYS_CLKRST_REG_I2S0_TX_DIV_N : R/W; bitpos: [20:13]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S0_TX_DIV_N    0x000000FFU
#define HP_SYS_CLKRST_REG_I2S0_TX_DIV_N_M  (HP_SYS_CLKRST_REG_I2S0_TX_DIV_N_V << HP_SYS_CLKRST_REG_I2S0_TX_DIV_N_S)
#define HP_SYS_CLKRST_REG_I2S0_TX_DIV_N_V  0x000000FFU
#define HP_SYS_CLKRST_REG_I2S0_TX_DIV_N_S  13
/** HP_SYS_CLKRST_REG_I2S0_TX_DIV_X : R/W; bitpos: [29:21]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S0_TX_DIV_X    0x000001FFU
#define HP_SYS_CLKRST_REG_I2S0_TX_DIV_X_M  (HP_SYS_CLKRST_REG_I2S0_TX_DIV_X_V << HP_SYS_CLKRST_REG_I2S0_TX_DIV_X_S)
#define HP_SYS_CLKRST_REG_I2S0_TX_DIV_X_V  0x000001FFU
#define HP_SYS_CLKRST_REG_I2S0_TX_DIV_X_S  21

/** HP_SYS_CLKRST_PERI_CLK_CTRL14_REG register
 *  Reserved
 */
#define HP_SYS_CLKRST_PERI_CLK_CTRL14_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x50)
/** HP_SYS_CLKRST_REG_I2S0_TX_DIV_Y : R/W; bitpos: [8:0]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S0_TX_DIV_Y    0x000001FFU
#define HP_SYS_CLKRST_REG_I2S0_TX_DIV_Y_M  (HP_SYS_CLKRST_REG_I2S0_TX_DIV_Y_V << HP_SYS_CLKRST_REG_I2S0_TX_DIV_Y_S)
#define HP_SYS_CLKRST_REG_I2S0_TX_DIV_Y_V  0x000001FFU
#define HP_SYS_CLKRST_REG_I2S0_TX_DIV_Y_S  0
/** HP_SYS_CLKRST_REG_I2S0_TX_DIV_Z : R/W; bitpos: [17:9]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S0_TX_DIV_Z    0x000001FFU
#define HP_SYS_CLKRST_REG_I2S0_TX_DIV_Z_M  (HP_SYS_CLKRST_REG_I2S0_TX_DIV_Z_V << HP_SYS_CLKRST_REG_I2S0_TX_DIV_Z_S)
#define HP_SYS_CLKRST_REG_I2S0_TX_DIV_Z_V  0x000001FFU
#define HP_SYS_CLKRST_REG_I2S0_TX_DIV_Z_S  9
/** HP_SYS_CLKRST_REG_I2S0_TX_DIV_YN1 : R/W; bitpos: [18]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S0_TX_DIV_YN1    (BIT(18))
#define HP_SYS_CLKRST_REG_I2S0_TX_DIV_YN1_M  (HP_SYS_CLKRST_REG_I2S0_TX_DIV_YN1_V << HP_SYS_CLKRST_REG_I2S0_TX_DIV_YN1_S)
#define HP_SYS_CLKRST_REG_I2S0_TX_DIV_YN1_V  0x00000001U
#define HP_SYS_CLKRST_REG_I2S0_TX_DIV_YN1_S  18
/** HP_SYS_CLKRST_REG_I2S0_MST_CLK_SEL : R/W; bitpos: [19]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S0_MST_CLK_SEL    (BIT(19))
#define HP_SYS_CLKRST_REG_I2S0_MST_CLK_SEL_M  (HP_SYS_CLKRST_REG_I2S0_MST_CLK_SEL_V << HP_SYS_CLKRST_REG_I2S0_MST_CLK_SEL_S)
#define HP_SYS_CLKRST_REG_I2S0_MST_CLK_SEL_V  0x00000001U
#define HP_SYS_CLKRST_REG_I2S0_MST_CLK_SEL_S  19
/** HP_SYS_CLKRST_REG_I2S1_RX_CLK_EN : R/W; bitpos: [20]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S1_RX_CLK_EN    (BIT(20))
#define HP_SYS_CLKRST_REG_I2S1_RX_CLK_EN_M  (HP_SYS_CLKRST_REG_I2S1_RX_CLK_EN_V << HP_SYS_CLKRST_REG_I2S1_RX_CLK_EN_S)
#define HP_SYS_CLKRST_REG_I2S1_RX_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_I2S1_RX_CLK_EN_S  20
/** HP_SYS_CLKRST_REG_I2S1_RX_CLK_SRC_SEL : R/W; bitpos: [22:21]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S1_RX_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_I2S1_RX_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_I2S1_RX_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_I2S1_RX_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_I2S1_RX_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_I2S1_RX_CLK_SRC_SEL_S  21
/** HP_SYS_CLKRST_REG_I2S1_RX_DIV_N : R/W; bitpos: [30:23]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S1_RX_DIV_N    0x000000FFU
#define HP_SYS_CLKRST_REG_I2S1_RX_DIV_N_M  (HP_SYS_CLKRST_REG_I2S1_RX_DIV_N_V << HP_SYS_CLKRST_REG_I2S1_RX_DIV_N_S)
#define HP_SYS_CLKRST_REG_I2S1_RX_DIV_N_V  0x000000FFU
#define HP_SYS_CLKRST_REG_I2S1_RX_DIV_N_S  23

/** HP_SYS_CLKRST_PERI_CLK_CTRL15_REG register
 *  Reserved
 */
#define HP_SYS_CLKRST_PERI_CLK_CTRL15_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x54)
/** HP_SYS_CLKRST_REG_I2S1_RX_DIV_X : R/W; bitpos: [8:0]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S1_RX_DIV_X    0x000001FFU
#define HP_SYS_CLKRST_REG_I2S1_RX_DIV_X_M  (HP_SYS_CLKRST_REG_I2S1_RX_DIV_X_V << HP_SYS_CLKRST_REG_I2S1_RX_DIV_X_S)
#define HP_SYS_CLKRST_REG_I2S1_RX_DIV_X_V  0x000001FFU
#define HP_SYS_CLKRST_REG_I2S1_RX_DIV_X_S  0
/** HP_SYS_CLKRST_REG_I2S1_RX_DIV_Y : R/W; bitpos: [17:9]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S1_RX_DIV_Y    0x000001FFU
#define HP_SYS_CLKRST_REG_I2S1_RX_DIV_Y_M  (HP_SYS_CLKRST_REG_I2S1_RX_DIV_Y_V << HP_SYS_CLKRST_REG_I2S1_RX_DIV_Y_S)
#define HP_SYS_CLKRST_REG_I2S1_RX_DIV_Y_V  0x000001FFU
#define HP_SYS_CLKRST_REG_I2S1_RX_DIV_Y_S  9
/** HP_SYS_CLKRST_REG_I2S1_RX_DIV_Z : R/W; bitpos: [26:18]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S1_RX_DIV_Z    0x000001FFU
#define HP_SYS_CLKRST_REG_I2S1_RX_DIV_Z_M  (HP_SYS_CLKRST_REG_I2S1_RX_DIV_Z_V << HP_SYS_CLKRST_REG_I2S1_RX_DIV_Z_S)
#define HP_SYS_CLKRST_REG_I2S1_RX_DIV_Z_V  0x000001FFU
#define HP_SYS_CLKRST_REG_I2S1_RX_DIV_Z_S  18
/** HP_SYS_CLKRST_REG_I2S1_RX_DIV_YN1 : R/W; bitpos: [27]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S1_RX_DIV_YN1    (BIT(27))
#define HP_SYS_CLKRST_REG_I2S1_RX_DIV_YN1_M  (HP_SYS_CLKRST_REG_I2S1_RX_DIV_YN1_V << HP_SYS_CLKRST_REG_I2S1_RX_DIV_YN1_S)
#define HP_SYS_CLKRST_REG_I2S1_RX_DIV_YN1_V  0x00000001U
#define HP_SYS_CLKRST_REG_I2S1_RX_DIV_YN1_S  27
/** HP_SYS_CLKRST_REG_I2S1_TX_CLK_EN : R/W; bitpos: [28]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S1_TX_CLK_EN    (BIT(28))
#define HP_SYS_CLKRST_REG_I2S1_TX_CLK_EN_M  (HP_SYS_CLKRST_REG_I2S1_TX_CLK_EN_V << HP_SYS_CLKRST_REG_I2S1_TX_CLK_EN_S)
#define HP_SYS_CLKRST_REG_I2S1_TX_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_I2S1_TX_CLK_EN_S  28
/** HP_SYS_CLKRST_REG_I2S1_TX_CLK_SRC_SEL : R/W; bitpos: [30:29]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S1_TX_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_I2S1_TX_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_I2S1_TX_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_I2S1_TX_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_I2S1_TX_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_I2S1_TX_CLK_SRC_SEL_S  29

