espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/hp_sys_clkrst_reg.h
/** HP_SYS_CLKRST_PERI_CLK_CTRL16_REG register
 *  Reserved
 */
#define HP_SYS_CLKRST_PERI_CLK_CTRL16_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x58)
/** HP_SYS_CLKRST_REG_I2S1_TX_DIV_N : R/W; bitpos: [7:0]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S1_TX_DIV_N    0x000000FFU
#define HP_SYS_CLKRST_REG_I2S1_TX_DIV_N_M  (HP_SYS_CLKRST_REG_I2S1_TX_DIV_N_V << HP_SYS_CLKRST_REG_I2S1_TX_DIV_N_S)
#define HP_SYS_CLKRST_REG_I2S1_TX_DIV_N_V  0x000000FFU
#define HP_SYS_CLKRST_REG_I2S1_TX_DIV_N_S  0
/** HP_SYS_CLKRST_REG_I2S1_TX_DIV_X : R/W; bitpos: [16:8]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S1_TX_DIV_X    0x000001FFU
#define HP_SYS_CLKRST_REG_I2S1_TX_DIV_X_M  (HP_SYS_CLKRST_REG_I2S1_TX_DIV_X_V << HP_SYS_CLKRST_REG_I2S1_TX_DIV_X_S)
#define HP_SYS_CLKRST_REG_I2S1_TX_DIV_X_V  0x000001FFU
#define HP_SYS_CLKRST_REG_I2S1_TX_DIV_X_S  8
/** HP_SYS_CLKRST_REG_I2S1_TX_DIV_Y : R/W; bitpos: [25:17]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S1_TX_DIV_Y    0x000001FFU
#define HP_SYS_CLKRST_REG_I2S1_TX_DIV_Y_M  (HP_SYS_CLKRST_REG_I2S1_TX_DIV_Y_V << HP_SYS_CLKRST_REG_I2S1_TX_DIV_Y_S)
#define HP_SYS_CLKRST_REG_I2S1_TX_DIV_Y_V  0x000001FFU
#define HP_SYS_CLKRST_REG_I2S1_TX_DIV_Y_S  17

/** HP_SYS_CLKRST_PERI_CLK_CTRL17_REG register
 *  Reserved
 */
#define HP_SYS_CLKRST_PERI_CLK_CTRL17_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x5c)
/** HP_SYS_CLKRST_REG_I2S1_TX_DIV_Z : R/W; bitpos: [8:0]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S1_TX_DIV_Z    0x000001FFU
#define HP_SYS_CLKRST_REG_I2S1_TX_DIV_Z_M  (HP_SYS_CLKRST_REG_I2S1_TX_DIV_Z_V << HP_SYS_CLKRST_REG_I2S1_TX_DIV_Z_S)
#define HP_SYS_CLKRST_REG_I2S1_TX_DIV_Z_V  0x000001FFU
#define HP_SYS_CLKRST_REG_I2S1_TX_DIV_Z_S  0
/** HP_SYS_CLKRST_REG_I2S1_TX_DIV_YN1 : R/W; bitpos: [9]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S1_TX_DIV_YN1    (BIT(9))
#define HP_SYS_CLKRST_REG_I2S1_TX_DIV_YN1_M  (HP_SYS_CLKRST_REG_I2S1_TX_DIV_YN1_V << HP_SYS_CLKRST_REG_I2S1_TX_DIV_YN1_S)
#define HP_SYS_CLKRST_REG_I2S1_TX_DIV_YN1_V  0x00000001U
#define HP_SYS_CLKRST_REG_I2S1_TX_DIV_YN1_S  9
/** HP_SYS_CLKRST_REG_I2S1_MST_CLK_SEL : R/W; bitpos: [10]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S1_MST_CLK_SEL    (BIT(10))
#define HP_SYS_CLKRST_REG_I2S1_MST_CLK_SEL_M  (HP_SYS_CLKRST_REG_I2S1_MST_CLK_SEL_V << HP_SYS_CLKRST_REG_I2S1_MST_CLK_SEL_S)
#define HP_SYS_CLKRST_REG_I2S1_MST_CLK_SEL_V  0x00000001U
#define HP_SYS_CLKRST_REG_I2S1_MST_CLK_SEL_S  10
/** HP_SYS_CLKRST_REG_I2S2_RX_CLK_EN : R/W; bitpos: [11]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S2_RX_CLK_EN    (BIT(11))
#define HP_SYS_CLKRST_REG_I2S2_RX_CLK_EN_M  (HP_SYS_CLKRST_REG_I2S2_RX_CLK_EN_V << HP_SYS_CLKRST_REG_I2S2_RX_CLK_EN_S)
#define HP_SYS_CLKRST_REG_I2S2_RX_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_I2S2_RX_CLK_EN_S  11
/** HP_SYS_CLKRST_REG_I2S2_RX_CLK_SRC_SEL : R/W; bitpos: [13:12]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S2_RX_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_I2S2_RX_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_I2S2_RX_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_I2S2_RX_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_I2S2_RX_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_I2S2_RX_CLK_SRC_SEL_S  12
/** HP_SYS_CLKRST_REG_I2S2_RX_DIV_N : R/W; bitpos: [21:14]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S2_RX_DIV_N    0x000000FFU
#define HP_SYS_CLKRST_REG_I2S2_RX_DIV_N_M  (HP_SYS_CLKRST_REG_I2S2_RX_DIV_N_V << HP_SYS_CLKRST_REG_I2S2_RX_DIV_N_S)
#define HP_SYS_CLKRST_REG_I2S2_RX_DIV_N_V  0x000000FFU
#define HP_SYS_CLKRST_REG_I2S2_RX_DIV_N_S  14
/** HP_SYS_CLKRST_REG_I2S2_RX_DIV_X : R/W; bitpos: [30:22]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S2_RX_DIV_X    0x000001FFU
#define HP_SYS_CLKRST_REG_I2S2_RX_DIV_X_M  (HP_SYS_CLKRST_REG_I2S2_RX_DIV_X_V << HP_SYS_CLKRST_REG_I2S2_RX_DIV_X_S)
#define HP_SYS_CLKRST_REG_I2S2_RX_DIV_X_V  0x000001FFU
#define HP_SYS_CLKRST_REG_I2S2_RX_DIV_X_S  22

/** HP_SYS_CLKRST_PERI_CLK_CTRL18_REG register
 *  Reserved
 */
#define HP_SYS_CLKRST_PERI_CLK_CTRL18_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x60)
/** HP_SYS_CLKRST_REG_I2S2_RX_DIV_Y : R/W; bitpos: [8:0]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S2_RX_DIV_Y    0x000001FFU
#define HP_SYS_CLKRST_REG_I2S2_RX_DIV_Y_M  (HP_SYS_CLKRST_REG_I2S2_RX_DIV_Y_V << HP_SYS_CLKRST_REG_I2S2_RX_DIV_Y_S)
#define HP_SYS_CLKRST_REG_I2S2_RX_DIV_Y_V  0x000001FFU
#define HP_SYS_CLKRST_REG_I2S2_RX_DIV_Y_S  0
/** HP_SYS_CLKRST_REG_I2S2_RX_DIV_Z : R/W; bitpos: [17:9]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S2_RX_DIV_Z    0x000001FFU
#define HP_SYS_CLKRST_REG_I2S2_RX_DIV_Z_M  (HP_SYS_CLKRST_REG_I2S2_RX_DIV_Z_V << HP_SYS_CLKRST_REG_I2S2_RX_DIV_Z_S)
#define HP_SYS_CLKRST_REG_I2S2_RX_DIV_Z_V  0x000001FFU
#define HP_SYS_CLKRST_REG_I2S2_RX_DIV_Z_S  9
/** HP_SYS_CLKRST_REG_I2S2_RX_DIV_YN1 : R/W; bitpos: [18]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S2_RX_DIV_YN1    (BIT(18))
#define HP_SYS_CLKRST_REG_I2S2_RX_DIV_YN1_M  (HP_SYS_CLKRST_REG_I2S2_RX_DIV_YN1_V << HP_SYS_CLKRST_REG_I2S2_RX_DIV_YN1_S)
#define HP_SYS_CLKRST_REG_I2S2_RX_DIV_YN1_V  0x00000001U
#define HP_SYS_CLKRST_REG_I2S2_RX_DIV_YN1_S  18
/** HP_SYS_CLKRST_REG_I2S2_TX_CLK_EN : R/W; bitpos: [19]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S2_TX_CLK_EN    (BIT(19))
#define HP_SYS_CLKRST_REG_I2S2_TX_CLK_EN_M  (HP_SYS_CLKRST_REG_I2S2_TX_CLK_EN_V << HP_SYS_CLKRST_REG_I2S2_TX_CLK_EN_S)
#define HP_SYS_CLKRST_REG_I2S2_TX_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_I2S2_TX_CLK_EN_S  19
/** HP_SYS_CLKRST_REG_I2S2_TX_CLK_SRC_SEL : R/W; bitpos: [21:20]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S2_TX_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_I2S2_TX_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_I2S2_TX_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_I2S2_TX_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_I2S2_TX_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_I2S2_TX_CLK_SRC_SEL_S  20
/** HP_SYS_CLKRST_REG_I2S2_TX_DIV_N : R/W; bitpos: [29:22]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S2_TX_DIV_N    0x000000FFU
#define HP_SYS_CLKRST_REG_I2S2_TX_DIV_N_M  (HP_SYS_CLKRST_REG_I2S2_TX_DIV_N_V << HP_SYS_CLKRST_REG_I2S2_TX_DIV_N_S)
#define HP_SYS_CLKRST_REG_I2S2_TX_DIV_N_V  0x000000FFU
#define HP_SYS_CLKRST_REG_I2S2_TX_DIV_N_S  22

/** HP_SYS_CLKRST_PERI_CLK_CTRL19_REG register
 *  Reserved
 */
#define HP_SYS_CLKRST_PERI_CLK_CTRL19_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x64)
/** HP_SYS_CLKRST_REG_I2S2_TX_DIV_X : R/W; bitpos: [8:0]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S2_TX_DIV_X    0x000001FFU
#define HP_SYS_CLKRST_REG_I2S2_TX_DIV_X_M  (HP_SYS_CLKRST_REG_I2S2_TX_DIV_X_V << HP_SYS_CLKRST_REG_I2S2_TX_DIV_X_S)
#define HP_SYS_CLKRST_REG_I2S2_TX_DIV_X_V  0x000001FFU
#define HP_SYS_CLKRST_REG_I2S2_TX_DIV_X_S  0
/** HP_SYS_CLKRST_REG_I2S2_TX_DIV_Y : R/W; bitpos: [17:9]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S2_TX_DIV_Y    0x000001FFU
#define HP_SYS_CLKRST_REG_I2S2_TX_DIV_Y_M  (HP_SYS_CLKRST_REG_I2S2_TX_DIV_Y_V << HP_SYS_CLKRST_REG_I2S2_TX_DIV_Y_S)
#define HP_SYS_CLKRST_REG_I2S2_TX_DIV_Y_V  0x000001FFU
#define HP_SYS_CLKRST_REG_I2S2_TX_DIV_Y_S  9
/** HP_SYS_CLKRST_REG_I2S2_TX_DIV_Z : R/W; bitpos: [26:18]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S2_TX_DIV_Z    0x000001FFU
#define HP_SYS_CLKRST_REG_I2S2_TX_DIV_Z_M  (HP_SYS_CLKRST_REG_I2S2_TX_DIV_Z_V << HP_SYS_CLKRST_REG_I2S2_TX_DIV_Z_S)
#define HP_SYS_CLKRST_REG_I2S2_TX_DIV_Z_V  0x000001FFU
#define HP_SYS_CLKRST_REG_I2S2_TX_DIV_Z_S  18
/** HP_SYS_CLKRST_REG_I2S2_TX_DIV_YN1 : R/W; bitpos: [27]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S2_TX_DIV_YN1    (BIT(27))
#define HP_SYS_CLKRST_REG_I2S2_TX_DIV_YN1_M  (HP_SYS_CLKRST_REG_I2S2_TX_DIV_YN1_V << HP_SYS_CLKRST_REG_I2S2_TX_DIV_YN1_S)
#define HP_SYS_CLKRST_REG_I2S2_TX_DIV_YN1_V  0x00000001U
#define HP_SYS_CLKRST_REG_I2S2_TX_DIV_YN1_S  27
/** HP_SYS_CLKRST_REG_I2S2_MST_CLK_SEL : R/W; bitpos: [28]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_I2S2_MST_CLK_SEL    (BIT(28))
#define HP_SYS_CLKRST_REG_I2S2_MST_CLK_SEL_M  (HP_SYS_CLKRST_REG_I2S2_MST_CLK_SEL_V << HP_SYS_CLKRST_REG_I2S2_MST_CLK_SEL_S)
#define HP_SYS_CLKRST_REG_I2S2_MST_CLK_SEL_V  0x00000001U
#define HP_SYS_CLKRST_REG_I2S2_MST_CLK_SEL_S  28
/** HP_SYS_CLKRST_REG_LCD_CLK_SRC_SEL : R/W; bitpos: [30:29]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_LCD_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_LCD_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_LCD_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_LCD_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_LCD_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_LCD_CLK_SRC_SEL_S  29
/** HP_SYS_CLKRST_REG_LCD_CLK_EN : R/W; bitpos: [31]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_LCD_CLK_EN    (BIT(31))
#define HP_SYS_CLKRST_REG_LCD_CLK_EN_M  (HP_SYS_CLKRST_REG_LCD_CLK_EN_V << HP_SYS_CLKRST_REG_LCD_CLK_EN_S)
#define HP_SYS_CLKRST_REG_LCD_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_LCD_CLK_EN_S  31

