espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/hp_sys_clkrst_reg.h
/** HP_SYS_CLKRST_PERI_CLK_CTRL110_REG register
 *  Reserved
 */
#define HP_SYS_CLKRST_PERI_CLK_CTRL110_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x68)
/** HP_SYS_CLKRST_REG_LCD_CLK_DIV_NUM : R/W; bitpos: [7:0]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_LCD_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_LCD_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_LCD_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_LCD_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_LCD_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_LCD_CLK_DIV_NUM_S  0
/** HP_SYS_CLKRST_REG_LCD_CLK_DIV_NUMERATOR : R/W; bitpos: [15:8]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_LCD_CLK_DIV_NUMERATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_LCD_CLK_DIV_NUMERATOR_M  (HP_SYS_CLKRST_REG_LCD_CLK_DIV_NUMERATOR_V << HP_SYS_CLKRST_REG_LCD_CLK_DIV_NUMERATOR_S)
#define HP_SYS_CLKRST_REG_LCD_CLK_DIV_NUMERATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_LCD_CLK_DIV_NUMERATOR_S  8
/** HP_SYS_CLKRST_REG_LCD_CLK_DIV_DENOMINATOR : R/W; bitpos: [23:16]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_LCD_CLK_DIV_DENOMINATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_LCD_CLK_DIV_DENOMINATOR_M  (HP_SYS_CLKRST_REG_LCD_CLK_DIV_DENOMINATOR_V << HP_SYS_CLKRST_REG_LCD_CLK_DIV_DENOMINATOR_S)
#define HP_SYS_CLKRST_REG_LCD_CLK_DIV_DENOMINATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_LCD_CLK_DIV_DENOMINATOR_S  16
/** HP_SYS_CLKRST_REG_UART0_CLK_SRC_SEL : R/W; bitpos: [25:24]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_UART0_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_UART0_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_UART0_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_UART0_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_UART0_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_UART0_CLK_SRC_SEL_S  24
/** HP_SYS_CLKRST_REG_UART0_CLK_EN : R/W; bitpos: [26]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_UART0_CLK_EN    (BIT(26))
#define HP_SYS_CLKRST_REG_UART0_CLK_EN_M  (HP_SYS_CLKRST_REG_UART0_CLK_EN_V << HP_SYS_CLKRST_REG_UART0_CLK_EN_S)
#define HP_SYS_CLKRST_REG_UART0_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_UART0_CLK_EN_S  26

/** HP_SYS_CLKRST_PERI_CLK_CTRL111_REG register
 *  Reserved
 */
#define HP_SYS_CLKRST_PERI_CLK_CTRL111_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x6c)
/** HP_SYS_CLKRST_REG_UART0_SCLK_DIV_NUM : R/W; bitpos: [7:0]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_UART0_SCLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_UART0_SCLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_UART0_SCLK_DIV_NUM_V << HP_SYS_CLKRST_REG_UART0_SCLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_UART0_SCLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_UART0_SCLK_DIV_NUM_S  0
/** HP_SYS_CLKRST_REG_UART0_SCLK_DIV_NUMERATOR : R/W; bitpos: [15:8]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_UART0_SCLK_DIV_NUMERATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_UART0_SCLK_DIV_NUMERATOR_M  (HP_SYS_CLKRST_REG_UART0_SCLK_DIV_NUMERATOR_V << HP_SYS_CLKRST_REG_UART0_SCLK_DIV_NUMERATOR_S)
#define HP_SYS_CLKRST_REG_UART0_SCLK_DIV_NUMERATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_UART0_SCLK_DIV_NUMERATOR_S  8
/** HP_SYS_CLKRST_REG_UART0_SCLK_DIV_DENOMINATOR : R/W; bitpos: [23:16]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_UART0_SCLK_DIV_DENOMINATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_UART0_SCLK_DIV_DENOMINATOR_M  (HP_SYS_CLKRST_REG_UART0_SCLK_DIV_DENOMINATOR_V << HP_SYS_CLKRST_REG_UART0_SCLK_DIV_DENOMINATOR_S)
#define HP_SYS_CLKRST_REG_UART0_SCLK_DIV_DENOMINATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_UART0_SCLK_DIV_DENOMINATOR_S  16
/** HP_SYS_CLKRST_REG_UART1_CLK_SRC_SEL : R/W; bitpos: [25:24]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_UART1_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_UART1_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_UART1_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_UART1_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_UART1_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_UART1_CLK_SRC_SEL_S  24
/** HP_SYS_CLKRST_REG_UART1_CLK_EN : R/W; bitpos: [26]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_UART1_CLK_EN    (BIT(26))
#define HP_SYS_CLKRST_REG_UART1_CLK_EN_M  (HP_SYS_CLKRST_REG_UART1_CLK_EN_V << HP_SYS_CLKRST_REG_UART1_CLK_EN_S)
#define HP_SYS_CLKRST_REG_UART1_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_UART1_CLK_EN_S  26

/** HP_SYS_CLKRST_PERI_CLK_CTRL112_REG register
 *  Reserved
 */
#define HP_SYS_CLKRST_PERI_CLK_CTRL112_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x70)
/** HP_SYS_CLKRST_REG_UART1_SCLK_DIV_NUM : R/W; bitpos: [7:0]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_UART1_SCLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_UART1_SCLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_UART1_SCLK_DIV_NUM_V << HP_SYS_CLKRST_REG_UART1_SCLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_UART1_SCLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_UART1_SCLK_DIV_NUM_S  0
/** HP_SYS_CLKRST_REG_UART1_SCLK_DIV_NUMERATOR : R/W; bitpos: [15:8]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_UART1_SCLK_DIV_NUMERATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_UART1_SCLK_DIV_NUMERATOR_M  (HP_SYS_CLKRST_REG_UART1_SCLK_DIV_NUMERATOR_V << HP_SYS_CLKRST_REG_UART1_SCLK_DIV_NUMERATOR_S)
#define HP_SYS_CLKRST_REG_UART1_SCLK_DIV_NUMERATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_UART1_SCLK_DIV_NUMERATOR_S  8
/** HP_SYS_CLKRST_REG_UART1_SCLK_DIV_DENOMINATOR : R/W; bitpos: [23:16]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_UART1_SCLK_DIV_DENOMINATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_UART1_SCLK_DIV_DENOMINATOR_M  (HP_SYS_CLKRST_REG_UART1_SCLK_DIV_DENOMINATOR_V << HP_SYS_CLKRST_REG_UART1_SCLK_DIV_DENOMINATOR_S)
#define HP_SYS_CLKRST_REG_UART1_SCLK_DIV_DENOMINATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_UART1_SCLK_DIV_DENOMINATOR_S  16
/** HP_SYS_CLKRST_REG_UART2_CLK_SRC_SEL : R/W; bitpos: [25:24]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_UART2_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_UART2_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_UART2_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_UART2_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_UART2_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_UART2_CLK_SRC_SEL_S  24
/** HP_SYS_CLKRST_REG_UART2_CLK_EN : R/W; bitpos: [26]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_UART2_CLK_EN    (BIT(26))
#define HP_SYS_CLKRST_REG_UART2_CLK_EN_M  (HP_SYS_CLKRST_REG_UART2_CLK_EN_V << HP_SYS_CLKRST_REG_UART2_CLK_EN_S)
#define HP_SYS_CLKRST_REG_UART2_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_UART2_CLK_EN_S  26

/** HP_SYS_CLKRST_PERI_CLK_CTRL113_REG register
 *  Reserved
 */
#define HP_SYS_CLKRST_PERI_CLK_CTRL113_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x74)
/** HP_SYS_CLKRST_REG_UART2_SCLK_DIV_NUM : R/W; bitpos: [7:0]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_UART2_SCLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_UART2_SCLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_UART2_SCLK_DIV_NUM_V << HP_SYS_CLKRST_REG_UART2_SCLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_UART2_SCLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_UART2_SCLK_DIV_NUM_S  0
/** HP_SYS_CLKRST_REG_UART2_SCLK_DIV_NUMERATOR : R/W; bitpos: [15:8]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_UART2_SCLK_DIV_NUMERATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_UART2_SCLK_DIV_NUMERATOR_M  (HP_SYS_CLKRST_REG_UART2_SCLK_DIV_NUMERATOR_V << HP_SYS_CLKRST_REG_UART2_SCLK_DIV_NUMERATOR_S)
#define HP_SYS_CLKRST_REG_UART2_SCLK_DIV_NUMERATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_UART2_SCLK_DIV_NUMERATOR_S  8
/** HP_SYS_CLKRST_REG_UART2_SCLK_DIV_DENOMINATOR : R/W; bitpos: [23:16]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_UART2_SCLK_DIV_DENOMINATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_UART2_SCLK_DIV_DENOMINATOR_M  (HP_SYS_CLKRST_REG_UART2_SCLK_DIV_DENOMINATOR_V << HP_SYS_CLKRST_REG_UART2_SCLK_DIV_DENOMINATOR_S)
#define HP_SYS_CLKRST_REG_UART2_SCLK_DIV_DENOMINATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_UART2_SCLK_DIV_DENOMINATOR_S  16
/** HP_SYS_CLKRST_REG_UART3_CLK_SRC_SEL : R/W; bitpos: [25:24]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_UART3_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_UART3_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_UART3_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_UART3_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_UART3_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_UART3_CLK_SRC_SEL_S  24
/** HP_SYS_CLKRST_REG_UART3_CLK_EN : R/W; bitpos: [26]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_UART3_CLK_EN    (BIT(26))
#define HP_SYS_CLKRST_REG_UART3_CLK_EN_M  (HP_SYS_CLKRST_REG_UART3_CLK_EN_V << HP_SYS_CLKRST_REG_UART3_CLK_EN_S)
#define HP_SYS_CLKRST_REG_UART3_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_UART3_CLK_EN_S  26

/** HP_SYS_CLKRST_PERI_CLK_CTRL114_REG register
 *  Reserved
 */
#define HP_SYS_CLKRST_PERI_CLK_CTRL114_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x78)
/** HP_SYS_CLKRST_REG_UART3_SCLK_DIV_NUM : R/W; bitpos: [7:0]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_UART3_SCLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_UART3_SCLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_UART3_SCLK_DIV_NUM_V << HP_SYS_CLKRST_REG_UART3_SCLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_UART3_SCLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_UART3_SCLK_DIV_NUM_S  0
/** HP_SYS_CLKRST_REG_UART3_SCLK_DIV_NUMERATOR : R/W; bitpos: [15:8]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_UART3_SCLK_DIV_NUMERATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_UART3_SCLK_DIV_NUMERATOR_M  (HP_SYS_CLKRST_REG_UART3_SCLK_DIV_NUMERATOR_V << HP_SYS_CLKRST_REG_UART3_SCLK_DIV_NUMERATOR_S)
#define HP_SYS_CLKRST_REG_UART3_SCLK_DIV_NUMERATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_UART3_SCLK_DIV_NUMERATOR_S  8
/** HP_SYS_CLKRST_REG_UART3_SCLK_DIV_DENOMINATOR : R/W; bitpos: [23:16]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_UART3_SCLK_DIV_DENOMINATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_UART3_SCLK_DIV_DENOMINATOR_M  (HP_SYS_CLKRST_REG_UART3_SCLK_DIV_DENOMINATOR_V << HP_SYS_CLKRST_REG_UART3_SCLK_DIV_DENOMINATOR_S)
#define HP_SYS_CLKRST_REG_UART3_SCLK_DIV_DENOMINATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_UART3_SCLK_DIV_DENOMINATOR_S  16
/** HP_SYS_CLKRST_REG_UART4_CLK_SRC_SEL : R/W; bitpos: [25:24]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_UART4_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_UART4_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_UART4_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_UART4_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_UART4_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_UART4_CLK_SRC_SEL_S  24
/** HP_SYS_CLKRST_REG_UART4_CLK_EN : R/W; bitpos: [26]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_UART4_CLK_EN    (BIT(26))
#define HP_SYS_CLKRST_REG_UART4_CLK_EN_M  (HP_SYS_CLKRST_REG_UART4_CLK_EN_V << HP_SYS_CLKRST_REG_UART4_CLK_EN_S)
#define HP_SYS_CLKRST_REG_UART4_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_UART4_CLK_EN_S  26

/** HP_SYS_CLKRST_PERI_CLK_CTRL115_REG register
 *  Reserved
 */
#define HP_SYS_CLKRST_PERI_CLK_CTRL115_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x7c)
/** HP_SYS_CLKRST_REG_UART4_SCLK_DIV_NUM : R/W; bitpos: [7:0]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_UART4_SCLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_UART4_SCLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_UART4_SCLK_DIV_NUM_V << HP_SYS_CLKRST_REG_UART4_SCLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_UART4_SCLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_UART4_SCLK_DIV_NUM_S  0
/** HP_SYS_CLKRST_REG_UART4_SCLK_DIV_NUMERATOR : R/W; bitpos: [15:8]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_UART4_SCLK_DIV_NUMERATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_UART4_SCLK_DIV_NUMERATOR_M  (HP_SYS_CLKRST_REG_UART4_SCLK_DIV_NUMERATOR_V << HP_SYS_CLKRST_REG_UART4_SCLK_DIV_NUMERATOR_S)
#define HP_SYS_CLKRST_REG_UART4_SCLK_DIV_NUMERATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_UART4_SCLK_DIV_NUMERATOR_S  8
/** HP_SYS_CLKRST_REG_UART4_SCLK_DIV_DENOMINATOR : R/W; bitpos: [23:16]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_UART4_SCLK_DIV_DENOMINATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_UART4_SCLK_DIV_DENOMINATOR_M  (HP_SYS_CLKRST_REG_UART4_SCLK_DIV_DENOMINATOR_V << HP_SYS_CLKRST_REG_UART4_SCLK_DIV_DENOMINATOR_S)
#define HP_SYS_CLKRST_REG_UART4_SCLK_DIV_DENOMINATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_UART4_SCLK_DIV_DENOMINATOR_S  16
/** HP_SYS_CLKRST_REG_TWAI0_CLK_SRC_SEL : R/W; bitpos: [24]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_TWAI0_CLK_SRC_SEL    (BIT(24))
#define HP_SYS_CLKRST_REG_TWAI0_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_TWAI0_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_TWAI0_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_TWAI0_CLK_SRC_SEL_V  0x00000001U
#define HP_SYS_CLKRST_REG_TWAI0_CLK_SRC_SEL_S  24
/** HP_SYS_CLKRST_REG_TWAI0_CLK_EN : R/W; bitpos: [25]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_TWAI0_CLK_EN    (BIT(25))
#define HP_SYS_CLKRST_REG_TWAI0_CLK_EN_M  (HP_SYS_CLKRST_REG_TWAI0_CLK_EN_V << HP_SYS_CLKRST_REG_TWAI0_CLK_EN_S)
#define HP_SYS_CLKRST_REG_TWAI0_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TWAI0_CLK_EN_S  25
/** HP_SYS_CLKRST_REG_TWAI1_CLK_SRC_SEL : R/W; bitpos: [26]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_TWAI1_CLK_SRC_SEL    (BIT(26))
#define HP_SYS_CLKRST_REG_TWAI1_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_TWAI1_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_TWAI1_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_TWAI1_CLK_SRC_SEL_V  0x00000001U
#define HP_SYS_CLKRST_REG_TWAI1_CLK_SRC_SEL_S  26
/** HP_SYS_CLKRST_REG_TWAI1_CLK_EN : R/W; bitpos: [27]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_TWAI1_CLK_EN    (BIT(27))
#define HP_SYS_CLKRST_REG_TWAI1_CLK_EN_M  (HP_SYS_CLKRST_REG_TWAI1_CLK_EN_V << HP_SYS_CLKRST_REG_TWAI1_CLK_EN_S)
#define HP_SYS_CLKRST_REG_TWAI1_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TWAI1_CLK_EN_S  27
/** HP_SYS_CLKRST_REG_TWAI2_CLK_SRC_SEL : R/W; bitpos: [28]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_TWAI2_CLK_SRC_SEL    (BIT(28))
#define HP_SYS_CLKRST_REG_TWAI2_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_TWAI2_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_TWAI2_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_TWAI2_CLK_SRC_SEL_V  0x00000001U
#define HP_SYS_CLKRST_REG_TWAI2_CLK_SRC_SEL_S  28
/** HP_SYS_CLKRST_REG_TWAI2_CLK_EN : R/W; bitpos: [29]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_TWAI2_CLK_EN    (BIT(29))
#define HP_SYS_CLKRST_REG_TWAI2_CLK_EN_M  (HP_SYS_CLKRST_REG_TWAI2_CLK_EN_V << HP_SYS_CLKRST_REG_TWAI2_CLK_EN_S)
#define HP_SYS_CLKRST_REG_TWAI2_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TWAI2_CLK_EN_S  29

/** HP_SYS_CLKRST_PERI_CLK_CTRL116_REG register
 *  Reserved
 */
#define HP_SYS_CLKRST_PERI_CLK_CTRL116_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x80)
/** HP_SYS_CLKRST_REG_GPSPI2_CLK_SRC_SEL : R/W; bitpos: [2:0]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_GPSPI2_CLK_SRC_SEL    0x00000007U
#define HP_SYS_CLKRST_REG_GPSPI2_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_GPSPI2_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_GPSPI2_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_GPSPI2_CLK_SRC_SEL_V  0x00000007U
#define HP_SYS_CLKRST_REG_GPSPI2_CLK_SRC_SEL_S  0
/** HP_SYS_CLKRST_REG_GPSPI2_HS_CLK_EN : R/W; bitpos: [3]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_GPSPI2_HS_CLK_EN    (BIT(3))
#define HP_SYS_CLKRST_REG_GPSPI2_HS_CLK_EN_M  (HP_SYS_CLKRST_REG_GPSPI2_HS_CLK_EN_V << HP_SYS_CLKRST_REG_GPSPI2_HS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_GPSPI2_HS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_GPSPI2_HS_CLK_EN_S  3
/** HP_SYS_CLKRST_REG_GPSPI2_HS_CLK_DIV_NUM : R/W; bitpos: [11:4]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_GPSPI2_HS_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_GPSPI2_HS_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_GPSPI2_HS_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_GPSPI2_HS_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_GPSPI2_HS_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_GPSPI2_HS_CLK_DIV_NUM_S  4
/** HP_SYS_CLKRST_REG_GPSPI2_MST_CLK_DIV_NUM : R/W; bitpos: [19:12]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_GPSPI2_MST_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_GPSPI2_MST_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_GPSPI2_MST_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_GPSPI2_MST_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_GPSPI2_MST_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_GPSPI2_MST_CLK_DIV_NUM_S  12
/** HP_SYS_CLKRST_REG_GPSPI2_MST_CLK_EN : R/W; bitpos: [20]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_GPSPI2_MST_CLK_EN    (BIT(20))
#define HP_SYS_CLKRST_REG_GPSPI2_MST_CLK_EN_M  (HP_SYS_CLKRST_REG_GPSPI2_MST_CLK_EN_V << HP_SYS_CLKRST_REG_GPSPI2_MST_CLK_EN_S)
#define HP_SYS_CLKRST_REG_GPSPI2_MST_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_GPSPI2_MST_CLK_EN_S  20
/** HP_SYS_CLKRST_REG_GPSPI3_CLK_SRC_SEL : R/W; bitpos: [23:21]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_GPSPI3_CLK_SRC_SEL    0x00000007U
#define HP_SYS_CLKRST_REG_GPSPI3_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_GPSPI3_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_GPSPI3_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_GPSPI3_CLK_SRC_SEL_V  0x00000007U
#define HP_SYS_CLKRST_REG_GPSPI3_CLK_SRC_SEL_S  21
/** HP_SYS_CLKRST_REG_GPSPI3_HS_CLK_EN : R/W; bitpos: [24]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_GPSPI3_HS_CLK_EN    (BIT(24))
#define HP_SYS_CLKRST_REG_GPSPI3_HS_CLK_EN_M  (HP_SYS_CLKRST_REG_GPSPI3_HS_CLK_EN_V << HP_SYS_CLKRST_REG_GPSPI3_HS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_GPSPI3_HS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_GPSPI3_HS_CLK_EN_S  24

