espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/hp_sys_clkrst_reg.h
/** HP_SYS_CLKRST_PERI_CLK_CTRL23_REG register
 *  Reserved
 */
#define HP_SYS_CLKRST_PERI_CLK_CTRL23_REG (DR_REG_HP_SYS_CLKRST_BASE + 0xa0)
/** HP_SYS_CLKRST_REG_ADC_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_ADC_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_ADC_CLK_EN_M  (HP_SYS_CLKRST_REG_ADC_CLK_EN_V << HP_SYS_CLKRST_REG_ADC_CLK_EN_S)
#define HP_SYS_CLKRST_REG_ADC_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_ADC_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_ADC_CLK_DIV_NUM : R/W; bitpos: [8:1]; default: 4;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_ADC_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_ADC_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_ADC_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_ADC_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_ADC_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_ADC_CLK_DIV_NUM_S  1
/** HP_SYS_CLKRST_REG_ADC_CLK_DIV_NUMERATOR : R/W; bitpos: [16:9]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_ADC_CLK_DIV_NUMERATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_ADC_CLK_DIV_NUMERATOR_M  (HP_SYS_CLKRST_REG_ADC_CLK_DIV_NUMERATOR_V << HP_SYS_CLKRST_REG_ADC_CLK_DIV_NUMERATOR_S)
#define HP_SYS_CLKRST_REG_ADC_CLK_DIV_NUMERATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_ADC_CLK_DIV_NUMERATOR_S  9
/** HP_SYS_CLKRST_REG_ADC_CLK_DIV_DENOMINATOR : R/W; bitpos: [24:17]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_ADC_CLK_DIV_DENOMINATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_ADC_CLK_DIV_DENOMINATOR_M  (HP_SYS_CLKRST_REG_ADC_CLK_DIV_DENOMINATOR_V << HP_SYS_CLKRST_REG_ADC_CLK_DIV_DENOMINATOR_S)
#define HP_SYS_CLKRST_REG_ADC_CLK_DIV_DENOMINATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_ADC_CLK_DIV_DENOMINATOR_S  17

/** HP_SYS_CLKRST_PERI_CLK_CTRL24_REG register
 *  Reserved
 */
#define HP_SYS_CLKRST_PERI_CLK_CTRL24_REG (DR_REG_HP_SYS_CLKRST_BASE + 0xa4)
/** HP_SYS_CLKRST_REG_ADC_SAR1_CLK_DIV_NUM : R/W; bitpos: [7:0]; default: 4;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_ADC_SAR1_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_ADC_SAR1_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_ADC_SAR1_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_ADC_SAR1_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_ADC_SAR1_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_ADC_SAR1_CLK_DIV_NUM_S  0
/** HP_SYS_CLKRST_REG_ADC_SAR2_CLK_DIV_NUM : R/W; bitpos: [15:8]; default: 4;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_ADC_SAR2_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_ADC_SAR2_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_ADC_SAR2_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_ADC_SAR2_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_ADC_SAR2_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_ADC_SAR2_CLK_DIV_NUM_S  8
/** HP_SYS_CLKRST_REG_PVT_CLK_DIV_NUM : R/W; bitpos: [23:16]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_PVT_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_PVT_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_PVT_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_PVT_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_PVT_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_PVT_CLK_DIV_NUM_S  16
/** HP_SYS_CLKRST_REG_PVT_CLK_EN : R/W; bitpos: [24]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_PVT_CLK_EN    (BIT(24))
#define HP_SYS_CLKRST_REG_PVT_CLK_EN_M  (HP_SYS_CLKRST_REG_PVT_CLK_EN_V << HP_SYS_CLKRST_REG_PVT_CLK_EN_S)
#define HP_SYS_CLKRST_REG_PVT_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PVT_CLK_EN_S  24

/** HP_SYS_CLKRST_PERI_CLK_CTRL25_REG register
 *  Reserved
 */
#define HP_SYS_CLKRST_PERI_CLK_CTRL25_REG (DR_REG_HP_SYS_CLKRST_BASE + 0xa8)
/** HP_SYS_CLKRST_REG_PVT_PERI_GROUP_CLK_DIV_NUM : R/W; bitpos: [7:0]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_PVT_PERI_GROUP_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_PVT_PERI_GROUP_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_PVT_PERI_GROUP_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_PVT_PERI_GROUP_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_PVT_PERI_GROUP_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_PVT_PERI_GROUP_CLK_DIV_NUM_S  0
/** HP_SYS_CLKRST_REG_PVT_PERI_GROUP1_CLK_EN : R/W; bitpos: [8]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_PVT_PERI_GROUP1_CLK_EN    (BIT(8))
#define HP_SYS_CLKRST_REG_PVT_PERI_GROUP1_CLK_EN_M  (HP_SYS_CLKRST_REG_PVT_PERI_GROUP1_CLK_EN_V << HP_SYS_CLKRST_REG_PVT_PERI_GROUP1_CLK_EN_S)
#define HP_SYS_CLKRST_REG_PVT_PERI_GROUP1_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PVT_PERI_GROUP1_CLK_EN_S  8
/** HP_SYS_CLKRST_REG_PVT_PERI_GROUP2_CLK_EN : R/W; bitpos: [9]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_PVT_PERI_GROUP2_CLK_EN    (BIT(9))
#define HP_SYS_CLKRST_REG_PVT_PERI_GROUP2_CLK_EN_M  (HP_SYS_CLKRST_REG_PVT_PERI_GROUP2_CLK_EN_V << HP_SYS_CLKRST_REG_PVT_PERI_GROUP2_CLK_EN_S)
#define HP_SYS_CLKRST_REG_PVT_PERI_GROUP2_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PVT_PERI_GROUP2_CLK_EN_S  9
/** HP_SYS_CLKRST_REG_PVT_PERI_GROUP3_CLK_EN : R/W; bitpos: [10]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_PVT_PERI_GROUP3_CLK_EN    (BIT(10))
#define HP_SYS_CLKRST_REG_PVT_PERI_GROUP3_CLK_EN_M  (HP_SYS_CLKRST_REG_PVT_PERI_GROUP3_CLK_EN_V << HP_SYS_CLKRST_REG_PVT_PERI_GROUP3_CLK_EN_S)
#define HP_SYS_CLKRST_REG_PVT_PERI_GROUP3_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PVT_PERI_GROUP3_CLK_EN_S  10
/** HP_SYS_CLKRST_REG_PVT_PERI_GROUP4_CLK_EN : R/W; bitpos: [11]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_PVT_PERI_GROUP4_CLK_EN    (BIT(11))
#define HP_SYS_CLKRST_REG_PVT_PERI_GROUP4_CLK_EN_M  (HP_SYS_CLKRST_REG_PVT_PERI_GROUP4_CLK_EN_V << HP_SYS_CLKRST_REG_PVT_PERI_GROUP4_CLK_EN_S)
#define HP_SYS_CLKRST_REG_PVT_PERI_GROUP4_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PVT_PERI_GROUP4_CLK_EN_S  11
/** HP_SYS_CLKRST_REG_CRYPTO_CLK_SRC_SEL : R/W; bitpos: [13:12]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_CRYPTO_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_CRYPTO_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_CRYPTO_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_CRYPTO_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_CRYPTO_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_CRYPTO_CLK_SRC_SEL_S  12
/** HP_SYS_CLKRST_REG_CRYPTO_AES_CLK_EN : R/W; bitpos: [14]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_CRYPTO_AES_CLK_EN    (BIT(14))
#define HP_SYS_CLKRST_REG_CRYPTO_AES_CLK_EN_M  (HP_SYS_CLKRST_REG_CRYPTO_AES_CLK_EN_V << HP_SYS_CLKRST_REG_CRYPTO_AES_CLK_EN_S)
#define HP_SYS_CLKRST_REG_CRYPTO_AES_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CRYPTO_AES_CLK_EN_S  14
/** HP_SYS_CLKRST_REG_CRYPTO_DS_CLK_EN : R/W; bitpos: [15]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_CRYPTO_DS_CLK_EN    (BIT(15))
#define HP_SYS_CLKRST_REG_CRYPTO_DS_CLK_EN_M  (HP_SYS_CLKRST_REG_CRYPTO_DS_CLK_EN_V << HP_SYS_CLKRST_REG_CRYPTO_DS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_CRYPTO_DS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CRYPTO_DS_CLK_EN_S  15
/** HP_SYS_CLKRST_REG_CRYPTO_ECC_CLK_EN : R/W; bitpos: [16]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_CRYPTO_ECC_CLK_EN    (BIT(16))
#define HP_SYS_CLKRST_REG_CRYPTO_ECC_CLK_EN_M  (HP_SYS_CLKRST_REG_CRYPTO_ECC_CLK_EN_V << HP_SYS_CLKRST_REG_CRYPTO_ECC_CLK_EN_S)
#define HP_SYS_CLKRST_REG_CRYPTO_ECC_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CRYPTO_ECC_CLK_EN_S  16
/** HP_SYS_CLKRST_REG_CRYPTO_HMAC_CLK_EN : R/W; bitpos: [17]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_CRYPTO_HMAC_CLK_EN    (BIT(17))
#define HP_SYS_CLKRST_REG_CRYPTO_HMAC_CLK_EN_M  (HP_SYS_CLKRST_REG_CRYPTO_HMAC_CLK_EN_V << HP_SYS_CLKRST_REG_CRYPTO_HMAC_CLK_EN_S)
#define HP_SYS_CLKRST_REG_CRYPTO_HMAC_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CRYPTO_HMAC_CLK_EN_S  17
/** HP_SYS_CLKRST_REG_CRYPTO_RSA_CLK_EN : R/W; bitpos: [18]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_CRYPTO_RSA_CLK_EN    (BIT(18))
#define HP_SYS_CLKRST_REG_CRYPTO_RSA_CLK_EN_M  (HP_SYS_CLKRST_REG_CRYPTO_RSA_CLK_EN_V << HP_SYS_CLKRST_REG_CRYPTO_RSA_CLK_EN_S)
#define HP_SYS_CLKRST_REG_CRYPTO_RSA_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CRYPTO_RSA_CLK_EN_S  18
/** HP_SYS_CLKRST_REG_CRYPTO_SEC_CLK_EN : R/W; bitpos: [19]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_CRYPTO_SEC_CLK_EN    (BIT(19))
#define HP_SYS_CLKRST_REG_CRYPTO_SEC_CLK_EN_M  (HP_SYS_CLKRST_REG_CRYPTO_SEC_CLK_EN_V << HP_SYS_CLKRST_REG_CRYPTO_SEC_CLK_EN_S)
#define HP_SYS_CLKRST_REG_CRYPTO_SEC_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CRYPTO_SEC_CLK_EN_S  19
/** HP_SYS_CLKRST_REG_CRYPTO_SHA_CLK_EN : R/W; bitpos: [20]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_CRYPTO_SHA_CLK_EN    (BIT(20))
#define HP_SYS_CLKRST_REG_CRYPTO_SHA_CLK_EN_M  (HP_SYS_CLKRST_REG_CRYPTO_SHA_CLK_EN_V << HP_SYS_CLKRST_REG_CRYPTO_SHA_CLK_EN_S)
#define HP_SYS_CLKRST_REG_CRYPTO_SHA_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CRYPTO_SHA_CLK_EN_S  20
/** HP_SYS_CLKRST_REG_CRYPTO_ECDSA_CLK_EN : R/W; bitpos: [21]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_CRYPTO_ECDSA_CLK_EN    (BIT(21))
#define HP_SYS_CLKRST_REG_CRYPTO_ECDSA_CLK_EN_M  (HP_SYS_CLKRST_REG_CRYPTO_ECDSA_CLK_EN_V << HP_SYS_CLKRST_REG_CRYPTO_ECDSA_CLK_EN_S)
#define HP_SYS_CLKRST_REG_CRYPTO_ECDSA_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CRYPTO_ECDSA_CLK_EN_S  21
/** HP_SYS_CLKRST_REG_CRYPTO_KM_CLK_EN : R/W; bitpos: [22]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_CRYPTO_KM_CLK_EN    (BIT(22))
#define HP_SYS_CLKRST_REG_CRYPTO_KM_CLK_EN_M  (HP_SYS_CLKRST_REG_CRYPTO_KM_CLK_EN_V << HP_SYS_CLKRST_REG_CRYPTO_KM_CLK_EN_S)
#define HP_SYS_CLKRST_REG_CRYPTO_KM_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CRYPTO_KM_CLK_EN_S  22
/** HP_SYS_CLKRST_REG_ISP_CLK_SRC_SEL : R/W; bitpos: [24:23]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_ISP_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_ISP_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_ISP_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_ISP_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_ISP_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_ISP_CLK_SRC_SEL_S  23
/** HP_SYS_CLKRST_REG_ISP_CLK_EN : R/W; bitpos: [25]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_ISP_CLK_EN    (BIT(25))
#define HP_SYS_CLKRST_REG_ISP_CLK_EN_M  (HP_SYS_CLKRST_REG_ISP_CLK_EN_V << HP_SYS_CLKRST_REG_ISP_CLK_EN_S)
#define HP_SYS_CLKRST_REG_ISP_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_ISP_CLK_EN_S  25

/** HP_SYS_CLKRST_PERI_CLK_CTRL26_REG register
 *  Reserved
 */
#define HP_SYS_CLKRST_PERI_CLK_CTRL26_REG (DR_REG_HP_SYS_CLKRST_BASE + 0xac)
/** HP_SYS_CLKRST_REG_ISP_CLK_DIV_NUM : R/W; bitpos: [7:0]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_ISP_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_ISP_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_ISP_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_ISP_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_ISP_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_ISP_CLK_DIV_NUM_S  0
/** HP_SYS_CLKRST_REG_IOMUX_CLK_SRC_SEL : R/W; bitpos: [8]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_IOMUX_CLK_SRC_SEL    (BIT(8))
#define HP_SYS_CLKRST_REG_IOMUX_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_IOMUX_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_IOMUX_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_IOMUX_CLK_SRC_SEL_V  0x00000001U
#define HP_SYS_CLKRST_REG_IOMUX_CLK_SRC_SEL_S  8
/** HP_SYS_CLKRST_REG_IOMUX_CLK_EN : R/W; bitpos: [9]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_IOMUX_CLK_EN    (BIT(9))
#define HP_SYS_CLKRST_REG_IOMUX_CLK_EN_M  (HP_SYS_CLKRST_REG_IOMUX_CLK_EN_V << HP_SYS_CLKRST_REG_IOMUX_CLK_EN_S)
#define HP_SYS_CLKRST_REG_IOMUX_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_IOMUX_CLK_EN_S  9
/** HP_SYS_CLKRST_REG_IOMUX_CLK_DIV_NUM : R/W; bitpos: [17:10]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_IOMUX_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_IOMUX_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_IOMUX_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_IOMUX_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_IOMUX_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_IOMUX_CLK_DIV_NUM_S  10
/** HP_SYS_CLKRST_REG_H264_CLK_SRC_SEL : R/W; bitpos: [18]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_H264_CLK_SRC_SEL    (BIT(18))
#define HP_SYS_CLKRST_REG_H264_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_H264_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_H264_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_H264_CLK_SRC_SEL_V  0x00000001U
#define HP_SYS_CLKRST_REG_H264_CLK_SRC_SEL_S  18
/** HP_SYS_CLKRST_REG_H264_CLK_EN : R/W; bitpos: [19]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_H264_CLK_EN    (BIT(19))
#define HP_SYS_CLKRST_REG_H264_CLK_EN_M  (HP_SYS_CLKRST_REG_H264_CLK_EN_V << HP_SYS_CLKRST_REG_H264_CLK_EN_S)
#define HP_SYS_CLKRST_REG_H264_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_H264_CLK_EN_S  19
/** HP_SYS_CLKRST_REG_H264_CLK_DIV_NUM : R/W; bitpos: [27:20]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_H264_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_H264_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_H264_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_H264_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_H264_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_H264_CLK_DIV_NUM_S  20
/** HP_SYS_CLKRST_REG_PADBIST_RX_CLK_SRC_SEL : R/W; bitpos: [28]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_PADBIST_RX_CLK_SRC_SEL    (BIT(28))
#define HP_SYS_CLKRST_REG_PADBIST_RX_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_PADBIST_RX_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_PADBIST_RX_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_PADBIST_RX_CLK_SRC_SEL_V  0x00000001U
#define HP_SYS_CLKRST_REG_PADBIST_RX_CLK_SRC_SEL_S  28
/** HP_SYS_CLKRST_REG_PADBIST_RX_CLK_EN : R/W; bitpos: [29]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_PADBIST_RX_CLK_EN    (BIT(29))
#define HP_SYS_CLKRST_REG_PADBIST_RX_CLK_EN_M  (HP_SYS_CLKRST_REG_PADBIST_RX_CLK_EN_V << HP_SYS_CLKRST_REG_PADBIST_RX_CLK_EN_S)
#define HP_SYS_CLKRST_REG_PADBIST_RX_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PADBIST_RX_CLK_EN_S  29

/** HP_SYS_CLKRST_PERI_CLK_CTRL27_REG register
 *  Reserved
 */
#define HP_SYS_CLKRST_PERI_CLK_CTRL27_REG (DR_REG_HP_SYS_CLKRST_BASE + 0xb0)
/** HP_SYS_CLKRST_REG_PADBIST_RX_CLK_DIV_NUM : R/W; bitpos: [7:0]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_PADBIST_RX_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_PADBIST_RX_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_PADBIST_RX_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_PADBIST_RX_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_PADBIST_RX_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_PADBIST_RX_CLK_DIV_NUM_S  0
/** HP_SYS_CLKRST_REG_PADBIST_TX_CLK_SRC_SEL : R/W; bitpos: [8]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_PADBIST_TX_CLK_SRC_SEL    (BIT(8))
#define HP_SYS_CLKRST_REG_PADBIST_TX_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_PADBIST_TX_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_PADBIST_TX_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_PADBIST_TX_CLK_SRC_SEL_V  0x00000001U
#define HP_SYS_CLKRST_REG_PADBIST_TX_CLK_SRC_SEL_S  8
/** HP_SYS_CLKRST_REG_PADBIST_TX_CLK_EN : R/W; bitpos: [9]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_PADBIST_TX_CLK_EN    (BIT(9))
#define HP_SYS_CLKRST_REG_PADBIST_TX_CLK_EN_M  (HP_SYS_CLKRST_REG_PADBIST_TX_CLK_EN_V << HP_SYS_CLKRST_REG_PADBIST_TX_CLK_EN_S)
#define HP_SYS_CLKRST_REG_PADBIST_TX_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PADBIST_TX_CLK_EN_S  9
/** HP_SYS_CLKRST_REG_PADBIST_TX_CLK_DIV_NUM : R/W; bitpos: [17:10]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_PADBIST_TX_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_PADBIST_TX_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_PADBIST_TX_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_PADBIST_TX_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_PADBIST_TX_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_PADBIST_TX_CLK_DIV_NUM_S  10

