espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/hp_sys_clkrst_reg.h
/** HP_SYS_CLKRST_CLK_FORCE_ON_CTRL0_REG register
 *  Reserved
 */
#define HP_SYS_CLKRST_CLK_FORCE_ON_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0xb4)
/** HP_SYS_CLKRST_REG_CPUICM_GATED_CLK_FORCE_ON : R/W; bitpos: [0]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_CPUICM_GATED_CLK_FORCE_ON    (BIT(0))
#define HP_SYS_CLKRST_REG_CPUICM_GATED_CLK_FORCE_ON_M  (HP_SYS_CLKRST_REG_CPUICM_GATED_CLK_FORCE_ON_V << HP_SYS_CLKRST_REG_CPUICM_GATED_CLK_FORCE_ON_S)
#define HP_SYS_CLKRST_REG_CPUICM_GATED_CLK_FORCE_ON_V  0x00000001U
#define HP_SYS_CLKRST_REG_CPUICM_GATED_CLK_FORCE_ON_S  0
/** HP_SYS_CLKRST_REG_TCM_CPU_CLK_FORCE_ON : R/W; bitpos: [1]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_TCM_CPU_CLK_FORCE_ON    (BIT(1))
#define HP_SYS_CLKRST_REG_TCM_CPU_CLK_FORCE_ON_M  (HP_SYS_CLKRST_REG_TCM_CPU_CLK_FORCE_ON_V << HP_SYS_CLKRST_REG_TCM_CPU_CLK_FORCE_ON_S)
#define HP_SYS_CLKRST_REG_TCM_CPU_CLK_FORCE_ON_V  0x00000001U
#define HP_SYS_CLKRST_REG_TCM_CPU_CLK_FORCE_ON_S  1
/** HP_SYS_CLKRST_REG_BUSMON_CPU_CLK_FORCE_ON : R/W; bitpos: [2]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_BUSMON_CPU_CLK_FORCE_ON    (BIT(2))
#define HP_SYS_CLKRST_REG_BUSMON_CPU_CLK_FORCE_ON_M  (HP_SYS_CLKRST_REG_BUSMON_CPU_CLK_FORCE_ON_V << HP_SYS_CLKRST_REG_BUSMON_CPU_CLK_FORCE_ON_S)
#define HP_SYS_CLKRST_REG_BUSMON_CPU_CLK_FORCE_ON_V  0x00000001U
#define HP_SYS_CLKRST_REG_BUSMON_CPU_CLK_FORCE_ON_S  2
/** HP_SYS_CLKRST_REG_L1CACHE_CPU_CLK_FORCE_ON : R/W; bitpos: [3]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_L1CACHE_CPU_CLK_FORCE_ON    (BIT(3))
#define HP_SYS_CLKRST_REG_L1CACHE_CPU_CLK_FORCE_ON_M  (HP_SYS_CLKRST_REG_L1CACHE_CPU_CLK_FORCE_ON_V << HP_SYS_CLKRST_REG_L1CACHE_CPU_CLK_FORCE_ON_S)
#define HP_SYS_CLKRST_REG_L1CACHE_CPU_CLK_FORCE_ON_V  0x00000001U
#define HP_SYS_CLKRST_REG_L1CACHE_CPU_CLK_FORCE_ON_S  3
/** HP_SYS_CLKRST_REG_L1CACHE_D_CPU_CLK_FORCE_ON : R/W; bitpos: [4]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_L1CACHE_D_CPU_CLK_FORCE_ON    (BIT(4))
#define HP_SYS_CLKRST_REG_L1CACHE_D_CPU_CLK_FORCE_ON_M  (HP_SYS_CLKRST_REG_L1CACHE_D_CPU_CLK_FORCE_ON_V << HP_SYS_CLKRST_REG_L1CACHE_D_CPU_CLK_FORCE_ON_S)
#define HP_SYS_CLKRST_REG_L1CACHE_D_CPU_CLK_FORCE_ON_V  0x00000001U
#define HP_SYS_CLKRST_REG_L1CACHE_D_CPU_CLK_FORCE_ON_S  4
/** HP_SYS_CLKRST_REG_L1CACHE_I0_CPU_CLK_FORCE_ON : R/W; bitpos: [5]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_L1CACHE_I0_CPU_CLK_FORCE_ON    (BIT(5))
#define HP_SYS_CLKRST_REG_L1CACHE_I0_CPU_CLK_FORCE_ON_M  (HP_SYS_CLKRST_REG_L1CACHE_I0_CPU_CLK_FORCE_ON_V << HP_SYS_CLKRST_REG_L1CACHE_I0_CPU_CLK_FORCE_ON_S)
#define HP_SYS_CLKRST_REG_L1CACHE_I0_CPU_CLK_FORCE_ON_V  0x00000001U
#define HP_SYS_CLKRST_REG_L1CACHE_I0_CPU_CLK_FORCE_ON_S  5
/** HP_SYS_CLKRST_REG_L1CACHE_I1_CPU_CLK_FORCE_ON : R/W; bitpos: [6]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_L1CACHE_I1_CPU_CLK_FORCE_ON    (BIT(6))
#define HP_SYS_CLKRST_REG_L1CACHE_I1_CPU_CLK_FORCE_ON_M  (HP_SYS_CLKRST_REG_L1CACHE_I1_CPU_CLK_FORCE_ON_V << HP_SYS_CLKRST_REG_L1CACHE_I1_CPU_CLK_FORCE_ON_S)
#define HP_SYS_CLKRST_REG_L1CACHE_I1_CPU_CLK_FORCE_ON_V  0x00000001U
#define HP_SYS_CLKRST_REG_L1CACHE_I1_CPU_CLK_FORCE_ON_S  6
/** HP_SYS_CLKRST_REG_TRACE_CPU_CLK_FORCE_ON : R/W; bitpos: [7]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_TRACE_CPU_CLK_FORCE_ON    (BIT(7))
#define HP_SYS_CLKRST_REG_TRACE_CPU_CLK_FORCE_ON_M  (HP_SYS_CLKRST_REG_TRACE_CPU_CLK_FORCE_ON_V << HP_SYS_CLKRST_REG_TRACE_CPU_CLK_FORCE_ON_S)
#define HP_SYS_CLKRST_REG_TRACE_CPU_CLK_FORCE_ON_V  0x00000001U
#define HP_SYS_CLKRST_REG_TRACE_CPU_CLK_FORCE_ON_S  7
/** HP_SYS_CLKRST_REG_TRACE_SYS_CLK_FORCE_ON : R/W; bitpos: [8]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_TRACE_SYS_CLK_FORCE_ON    (BIT(8))
#define HP_SYS_CLKRST_REG_TRACE_SYS_CLK_FORCE_ON_M  (HP_SYS_CLKRST_REG_TRACE_SYS_CLK_FORCE_ON_V << HP_SYS_CLKRST_REG_TRACE_SYS_CLK_FORCE_ON_S)
#define HP_SYS_CLKRST_REG_TRACE_SYS_CLK_FORCE_ON_V  0x00000001U
#define HP_SYS_CLKRST_REG_TRACE_SYS_CLK_FORCE_ON_S  8
/** HP_SYS_CLKRST_REG_L1CACHE_MEM_CLK_FORCE_ON : R/W; bitpos: [9]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_L1CACHE_MEM_CLK_FORCE_ON    (BIT(9))
#define HP_SYS_CLKRST_REG_L1CACHE_MEM_CLK_FORCE_ON_M  (HP_SYS_CLKRST_REG_L1CACHE_MEM_CLK_FORCE_ON_V << HP_SYS_CLKRST_REG_L1CACHE_MEM_CLK_FORCE_ON_S)
#define HP_SYS_CLKRST_REG_L1CACHE_MEM_CLK_FORCE_ON_V  0x00000001U
#define HP_SYS_CLKRST_REG_L1CACHE_MEM_CLK_FORCE_ON_S  9
/** HP_SYS_CLKRST_REG_L1CACHE_D_MEM_CLK_FORCE_ON : R/W; bitpos: [10]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_L1CACHE_D_MEM_CLK_FORCE_ON    (BIT(10))
#define HP_SYS_CLKRST_REG_L1CACHE_D_MEM_CLK_FORCE_ON_M  (HP_SYS_CLKRST_REG_L1CACHE_D_MEM_CLK_FORCE_ON_V << HP_SYS_CLKRST_REG_L1CACHE_D_MEM_CLK_FORCE_ON_S)
#define HP_SYS_CLKRST_REG_L1CACHE_D_MEM_CLK_FORCE_ON_V  0x00000001U
#define HP_SYS_CLKRST_REG_L1CACHE_D_MEM_CLK_FORCE_ON_S  10
/** HP_SYS_CLKRST_REG_L1CACHE_I0_MEM_CLK_FORCE_ON : R/W; bitpos: [11]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_L1CACHE_I0_MEM_CLK_FORCE_ON    (BIT(11))
#define HP_SYS_CLKRST_REG_L1CACHE_I0_MEM_CLK_FORCE_ON_M  (HP_SYS_CLKRST_REG_L1CACHE_I0_MEM_CLK_FORCE_ON_V << HP_SYS_CLKRST_REG_L1CACHE_I0_MEM_CLK_FORCE_ON_S)
#define HP_SYS_CLKRST_REG_L1CACHE_I0_MEM_CLK_FORCE_ON_V  0x00000001U
#define HP_SYS_CLKRST_REG_L1CACHE_I0_MEM_CLK_FORCE_ON_S  11
/** HP_SYS_CLKRST_REG_L1CACHE_I1_MEM_CLK_FORCE_ON : R/W; bitpos: [12]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_L1CACHE_I1_MEM_CLK_FORCE_ON    (BIT(12))
#define HP_SYS_CLKRST_REG_L1CACHE_I1_MEM_CLK_FORCE_ON_M  (HP_SYS_CLKRST_REG_L1CACHE_I1_MEM_CLK_FORCE_ON_V << HP_SYS_CLKRST_REG_L1CACHE_I1_MEM_CLK_FORCE_ON_S)
#define HP_SYS_CLKRST_REG_L1CACHE_I1_MEM_CLK_FORCE_ON_V  0x00000001U
#define HP_SYS_CLKRST_REG_L1CACHE_I1_MEM_CLK_FORCE_ON_S  12
/** HP_SYS_CLKRST_REG_L2CACHE_MEM_CLK_FORCE_ON : R/W; bitpos: [13]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_L2CACHE_MEM_CLK_FORCE_ON    (BIT(13))
#define HP_SYS_CLKRST_REG_L2CACHE_MEM_CLK_FORCE_ON_M  (HP_SYS_CLKRST_REG_L2CACHE_MEM_CLK_FORCE_ON_V << HP_SYS_CLKRST_REG_L2CACHE_MEM_CLK_FORCE_ON_S)
#define HP_SYS_CLKRST_REG_L2CACHE_MEM_CLK_FORCE_ON_V  0x00000001U
#define HP_SYS_CLKRST_REG_L2CACHE_MEM_CLK_FORCE_ON_S  13
/** HP_SYS_CLKRST_REG_L2MEM_MEM_CLK_FORCE_ON : R/W; bitpos: [14]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_L2MEM_MEM_CLK_FORCE_ON    (BIT(14))
#define HP_SYS_CLKRST_REG_L2MEM_MEM_CLK_FORCE_ON_M  (HP_SYS_CLKRST_REG_L2MEM_MEM_CLK_FORCE_ON_V << HP_SYS_CLKRST_REG_L2MEM_MEM_CLK_FORCE_ON_S)
#define HP_SYS_CLKRST_REG_L2MEM_MEM_CLK_FORCE_ON_V  0x00000001U
#define HP_SYS_CLKRST_REG_L2MEM_MEM_CLK_FORCE_ON_S  14
/** HP_SYS_CLKRST_REG_SAR1_CLK_FORCE_ON : R/W; bitpos: [15]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_SAR1_CLK_FORCE_ON    (BIT(15))
#define HP_SYS_CLKRST_REG_SAR1_CLK_FORCE_ON_M  (HP_SYS_CLKRST_REG_SAR1_CLK_FORCE_ON_V << HP_SYS_CLKRST_REG_SAR1_CLK_FORCE_ON_S)
#define HP_SYS_CLKRST_REG_SAR1_CLK_FORCE_ON_V  0x00000001U
#define HP_SYS_CLKRST_REG_SAR1_CLK_FORCE_ON_S  15
/** HP_SYS_CLKRST_REG_SAR2_CLK_FORCE_ON : R/W; bitpos: [16]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_SAR2_CLK_FORCE_ON    (BIT(16))
#define HP_SYS_CLKRST_REG_SAR2_CLK_FORCE_ON_M  (HP_SYS_CLKRST_REG_SAR2_CLK_FORCE_ON_V << HP_SYS_CLKRST_REG_SAR2_CLK_FORCE_ON_S)
#define HP_SYS_CLKRST_REG_SAR2_CLK_FORCE_ON_V  0x00000001U
#define HP_SYS_CLKRST_REG_SAR2_CLK_FORCE_ON_S  16
/** HP_SYS_CLKRST_REG_GMAC_TX_CLK_FORCE_ON : R/W; bitpos: [17]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_GMAC_TX_CLK_FORCE_ON    (BIT(17))
#define HP_SYS_CLKRST_REG_GMAC_TX_CLK_FORCE_ON_M  (HP_SYS_CLKRST_REG_GMAC_TX_CLK_FORCE_ON_V << HP_SYS_CLKRST_REG_GMAC_TX_CLK_FORCE_ON_S)
#define HP_SYS_CLKRST_REG_GMAC_TX_CLK_FORCE_ON_V  0x00000001U
#define HP_SYS_CLKRST_REG_GMAC_TX_CLK_FORCE_ON_S  17
/** HP_SYS_CLKRST_REG_L2CACHE_L2MEM_CLK_FORCE_ON : R/W; bitpos: [18]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_L2CACHE_L2MEM_CLK_FORCE_ON    (BIT(18))
#define HP_SYS_CLKRST_REG_L2CACHE_L2MEM_CLK_FORCE_ON_M  (HP_SYS_CLKRST_REG_L2CACHE_L2MEM_CLK_FORCE_ON_V << HP_SYS_CLKRST_REG_L2CACHE_L2MEM_CLK_FORCE_ON_S)
#define HP_SYS_CLKRST_REG_L2CACHE_L2MEM_CLK_FORCE_ON_V  0x00000001U
#define HP_SYS_CLKRST_REG_L2CACHE_L2MEM_CLK_FORCE_ON_S  18

/** HP_SYS_CLKRST_DPA_CTRL0_REG register
 *  Reserved
 */
#define HP_SYS_CLKRST_DPA_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0xb8)
/** HP_SYS_CLKRST_REG_SEC_DPA_LEVEL : R/W; bitpos: [1:0]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_SEC_DPA_LEVEL    0x00000003U
#define HP_SYS_CLKRST_REG_SEC_DPA_LEVEL_M  (HP_SYS_CLKRST_REG_SEC_DPA_LEVEL_V << HP_SYS_CLKRST_REG_SEC_DPA_LEVEL_S)
#define HP_SYS_CLKRST_REG_SEC_DPA_LEVEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_SEC_DPA_LEVEL_S  0
/** HP_SYS_CLKRST_REG_SEC_DPA_CFG_SEL : R/W; bitpos: [2]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_SEC_DPA_CFG_SEL    (BIT(2))
#define HP_SYS_CLKRST_REG_SEC_DPA_CFG_SEL_M  (HP_SYS_CLKRST_REG_SEC_DPA_CFG_SEL_V << HP_SYS_CLKRST_REG_SEC_DPA_CFG_SEL_S)
#define HP_SYS_CLKRST_REG_SEC_DPA_CFG_SEL_V  0x00000001U
#define HP_SYS_CLKRST_REG_SEC_DPA_CFG_SEL_S  2

