espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/hp_sys_clkrst_reg.h
/** HP_SYS_CLKRST_ANA_PLL_CTRL0_REG register
 *  Reserved
 */
#define HP_SYS_CLKRST_ANA_PLL_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0xbc)
/** HP_SYS_CLKRST_REG_PLLA_CAL_END : RO; bitpos: [0]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_PLLA_CAL_END    (BIT(0))
#define HP_SYS_CLKRST_REG_PLLA_CAL_END_M  (HP_SYS_CLKRST_REG_PLLA_CAL_END_V << HP_SYS_CLKRST_REG_PLLA_CAL_END_S)
#define HP_SYS_CLKRST_REG_PLLA_CAL_END_V  0x00000001U
#define HP_SYS_CLKRST_REG_PLLA_CAL_END_S  0
/** HP_SYS_CLKRST_REG_PLLA_CAL_STOP : R/W; bitpos: [1]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_PLLA_CAL_STOP    (BIT(1))
#define HP_SYS_CLKRST_REG_PLLA_CAL_STOP_M  (HP_SYS_CLKRST_REG_PLLA_CAL_STOP_V << HP_SYS_CLKRST_REG_PLLA_CAL_STOP_S)
#define HP_SYS_CLKRST_REG_PLLA_CAL_STOP_V  0x00000001U
#define HP_SYS_CLKRST_REG_PLLA_CAL_STOP_S  1
/** HP_SYS_CLKRST_REG_CPU_PLL_CAL_END : RO; bitpos: [2]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_CPU_PLL_CAL_END    (BIT(2))
#define HP_SYS_CLKRST_REG_CPU_PLL_CAL_END_M  (HP_SYS_CLKRST_REG_CPU_PLL_CAL_END_V << HP_SYS_CLKRST_REG_CPU_PLL_CAL_END_S)
#define HP_SYS_CLKRST_REG_CPU_PLL_CAL_END_V  0x00000001U
#define HP_SYS_CLKRST_REG_CPU_PLL_CAL_END_S  2
/** HP_SYS_CLKRST_REG_CPU_PLL_CAL_STOP : R/W; bitpos: [3]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_CPU_PLL_CAL_STOP    (BIT(3))
#define HP_SYS_CLKRST_REG_CPU_PLL_CAL_STOP_M  (HP_SYS_CLKRST_REG_CPU_PLL_CAL_STOP_V << HP_SYS_CLKRST_REG_CPU_PLL_CAL_STOP_S)
#define HP_SYS_CLKRST_REG_CPU_PLL_CAL_STOP_V  0x00000001U
#define HP_SYS_CLKRST_REG_CPU_PLL_CAL_STOP_S  3
/** HP_SYS_CLKRST_REG_SDIO_PLL_CAL_END : RO; bitpos: [4]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_SDIO_PLL_CAL_END    (BIT(4))
#define HP_SYS_CLKRST_REG_SDIO_PLL_CAL_END_M  (HP_SYS_CLKRST_REG_SDIO_PLL_CAL_END_V << HP_SYS_CLKRST_REG_SDIO_PLL_CAL_END_S)
#define HP_SYS_CLKRST_REG_SDIO_PLL_CAL_END_V  0x00000001U
#define HP_SYS_CLKRST_REG_SDIO_PLL_CAL_END_S  4
/** HP_SYS_CLKRST_REG_SDIO_PLL_CAL_STOP : R/W; bitpos: [5]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_SDIO_PLL_CAL_STOP    (BIT(5))
#define HP_SYS_CLKRST_REG_SDIO_PLL_CAL_STOP_M  (HP_SYS_CLKRST_REG_SDIO_PLL_CAL_STOP_V << HP_SYS_CLKRST_REG_SDIO_PLL_CAL_STOP_S)
#define HP_SYS_CLKRST_REG_SDIO_PLL_CAL_STOP_V  0x00000001U
#define HP_SYS_CLKRST_REG_SDIO_PLL_CAL_STOP_S  5
/** HP_SYS_CLKRST_REG_SYS_PLL_CAL_END : RO; bitpos: [6]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_SYS_PLL_CAL_END    (BIT(6))
#define HP_SYS_CLKRST_REG_SYS_PLL_CAL_END_M  (HP_SYS_CLKRST_REG_SYS_PLL_CAL_END_V << HP_SYS_CLKRST_REG_SYS_PLL_CAL_END_S)
#define HP_SYS_CLKRST_REG_SYS_PLL_CAL_END_V  0x00000001U
#define HP_SYS_CLKRST_REG_SYS_PLL_CAL_END_S  6
/** HP_SYS_CLKRST_REG_SYS_PLL_CAL_STOP : R/W; bitpos: [7]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_SYS_PLL_CAL_STOP    (BIT(7))
#define HP_SYS_CLKRST_REG_SYS_PLL_CAL_STOP_M  (HP_SYS_CLKRST_REG_SYS_PLL_CAL_STOP_V << HP_SYS_CLKRST_REG_SYS_PLL_CAL_STOP_S)
#define HP_SYS_CLKRST_REG_SYS_PLL_CAL_STOP_V  0x00000001U
#define HP_SYS_CLKRST_REG_SYS_PLL_CAL_STOP_S  7
/** HP_SYS_CLKRST_REG_MSPI_CAL_END : RO; bitpos: [8]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_MSPI_CAL_END    (BIT(8))
#define HP_SYS_CLKRST_REG_MSPI_CAL_END_M  (HP_SYS_CLKRST_REG_MSPI_CAL_END_V << HP_SYS_CLKRST_REG_MSPI_CAL_END_S)
#define HP_SYS_CLKRST_REG_MSPI_CAL_END_V  0x00000001U
#define HP_SYS_CLKRST_REG_MSPI_CAL_END_S  8
/** HP_SYS_CLKRST_REG_MSPI_CAL_STOP : R/W; bitpos: [9]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_MSPI_CAL_STOP    (BIT(9))
#define HP_SYS_CLKRST_REG_MSPI_CAL_STOP_M  (HP_SYS_CLKRST_REG_MSPI_CAL_STOP_V << HP_SYS_CLKRST_REG_MSPI_CAL_STOP_S)
#define HP_SYS_CLKRST_REG_MSPI_CAL_STOP_V  0x00000001U
#define HP_SYS_CLKRST_REG_MSPI_CAL_STOP_S  9

/** HP_SYS_CLKRST_HP_RST_EN0_REG register
 *  Reserved
 */
#define HP_SYS_CLKRST_HP_RST_EN0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0xc0)
/** HP_SYS_CLKRST_REG_RST_EN_CORECTRL : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_CORECTRL    (BIT(0))
#define HP_SYS_CLKRST_REG_RST_EN_CORECTRL_M  (HP_SYS_CLKRST_REG_RST_EN_CORECTRL_V << HP_SYS_CLKRST_REG_RST_EN_CORECTRL_S)
#define HP_SYS_CLKRST_REG_RST_EN_CORECTRL_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_CORECTRL_S  0
/** HP_SYS_CLKRST_REG_RST_EN_PVT_TOP : R/W; bitpos: [1]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_PVT_TOP    (BIT(1))
#define HP_SYS_CLKRST_REG_RST_EN_PVT_TOP_M  (HP_SYS_CLKRST_REG_RST_EN_PVT_TOP_V << HP_SYS_CLKRST_REG_RST_EN_PVT_TOP_S)
#define HP_SYS_CLKRST_REG_RST_EN_PVT_TOP_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_PVT_TOP_S  1
/** HP_SYS_CLKRST_REG_RST_EN_PVT_PERI_GROUP1 : R/W; bitpos: [2]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_PVT_PERI_GROUP1    (BIT(2))
#define HP_SYS_CLKRST_REG_RST_EN_PVT_PERI_GROUP1_M  (HP_SYS_CLKRST_REG_RST_EN_PVT_PERI_GROUP1_V << HP_SYS_CLKRST_REG_RST_EN_PVT_PERI_GROUP1_S)
#define HP_SYS_CLKRST_REG_RST_EN_PVT_PERI_GROUP1_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_PVT_PERI_GROUP1_S  2
/** HP_SYS_CLKRST_REG_RST_EN_PVT_PERI_GROUP2 : R/W; bitpos: [3]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_PVT_PERI_GROUP2    (BIT(3))
#define HP_SYS_CLKRST_REG_RST_EN_PVT_PERI_GROUP2_M  (HP_SYS_CLKRST_REG_RST_EN_PVT_PERI_GROUP2_V << HP_SYS_CLKRST_REG_RST_EN_PVT_PERI_GROUP2_S)
#define HP_SYS_CLKRST_REG_RST_EN_PVT_PERI_GROUP2_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_PVT_PERI_GROUP2_S  3
/** HP_SYS_CLKRST_REG_RST_EN_PVT_PERI_GROUP3 : R/W; bitpos: [4]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_PVT_PERI_GROUP3    (BIT(4))
#define HP_SYS_CLKRST_REG_RST_EN_PVT_PERI_GROUP3_M  (HP_SYS_CLKRST_REG_RST_EN_PVT_PERI_GROUP3_V << HP_SYS_CLKRST_REG_RST_EN_PVT_PERI_GROUP3_S)
#define HP_SYS_CLKRST_REG_RST_EN_PVT_PERI_GROUP3_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_PVT_PERI_GROUP3_S  4
/** HP_SYS_CLKRST_REG_RST_EN_PVT_PERI_GROUP4 : R/W; bitpos: [5]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_PVT_PERI_GROUP4    (BIT(5))
#define HP_SYS_CLKRST_REG_RST_EN_PVT_PERI_GROUP4_M  (HP_SYS_CLKRST_REG_RST_EN_PVT_PERI_GROUP4_V << HP_SYS_CLKRST_REG_RST_EN_PVT_PERI_GROUP4_S)
#define HP_SYS_CLKRST_REG_RST_EN_PVT_PERI_GROUP4_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_PVT_PERI_GROUP4_S  5
/** HP_SYS_CLKRST_REG_RST_EN_REGDMA : R/W; bitpos: [6]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_REGDMA    (BIT(6))
#define HP_SYS_CLKRST_REG_RST_EN_REGDMA_M  (HP_SYS_CLKRST_REG_RST_EN_REGDMA_V << HP_SYS_CLKRST_REG_RST_EN_REGDMA_S)
#define HP_SYS_CLKRST_REG_RST_EN_REGDMA_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_REGDMA_S  6
/** HP_SYS_CLKRST_REG_RST_EN_CORE0_GLOBAL : R/W; bitpos: [7]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_CORE0_GLOBAL    (BIT(7))
#define HP_SYS_CLKRST_REG_RST_EN_CORE0_GLOBAL_M  (HP_SYS_CLKRST_REG_RST_EN_CORE0_GLOBAL_V << HP_SYS_CLKRST_REG_RST_EN_CORE0_GLOBAL_S)
#define HP_SYS_CLKRST_REG_RST_EN_CORE0_GLOBAL_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_CORE0_GLOBAL_S  7
/** HP_SYS_CLKRST_REG_RST_EN_CORE1_GLOBAL : R/W; bitpos: [8]; default: 1;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_CORE1_GLOBAL    (BIT(8))
#define HP_SYS_CLKRST_REG_RST_EN_CORE1_GLOBAL_M  (HP_SYS_CLKRST_REG_RST_EN_CORE1_GLOBAL_V << HP_SYS_CLKRST_REG_RST_EN_CORE1_GLOBAL_S)
#define HP_SYS_CLKRST_REG_RST_EN_CORE1_GLOBAL_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_CORE1_GLOBAL_S  8
/** HP_SYS_CLKRST_REG_RST_EN_CORETRACE0 : R/W; bitpos: [9]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_CORETRACE0    (BIT(9))
#define HP_SYS_CLKRST_REG_RST_EN_CORETRACE0_M  (HP_SYS_CLKRST_REG_RST_EN_CORETRACE0_V << HP_SYS_CLKRST_REG_RST_EN_CORETRACE0_S)
#define HP_SYS_CLKRST_REG_RST_EN_CORETRACE0_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_CORETRACE0_S  9
/** HP_SYS_CLKRST_REG_RST_EN_CORETRACE1 : R/W; bitpos: [10]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_CORETRACE1    (BIT(10))
#define HP_SYS_CLKRST_REG_RST_EN_CORETRACE1_M  (HP_SYS_CLKRST_REG_RST_EN_CORETRACE1_V << HP_SYS_CLKRST_REG_RST_EN_CORETRACE1_S)
#define HP_SYS_CLKRST_REG_RST_EN_CORETRACE1_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_CORETRACE1_S  10
/** HP_SYS_CLKRST_REG_RST_EN_HP_TCM : R/W; bitpos: [11]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_HP_TCM    (BIT(11))
#define HP_SYS_CLKRST_REG_RST_EN_HP_TCM_M  (HP_SYS_CLKRST_REG_RST_EN_HP_TCM_V << HP_SYS_CLKRST_REG_RST_EN_HP_TCM_S)
#define HP_SYS_CLKRST_REG_RST_EN_HP_TCM_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_HP_TCM_S  11
/** HP_SYS_CLKRST_REG_RST_EN_HP_CACHE : R/W; bitpos: [12]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_HP_CACHE    (BIT(12))
#define HP_SYS_CLKRST_REG_RST_EN_HP_CACHE_M  (HP_SYS_CLKRST_REG_RST_EN_HP_CACHE_V << HP_SYS_CLKRST_REG_RST_EN_HP_CACHE_S)
#define HP_SYS_CLKRST_REG_RST_EN_HP_CACHE_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_HP_CACHE_S  12
/** HP_SYS_CLKRST_REG_RST_EN_L1_I0_CACHE : R/W; bitpos: [13]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_L1_I0_CACHE    (BIT(13))
#define HP_SYS_CLKRST_REG_RST_EN_L1_I0_CACHE_M  (HP_SYS_CLKRST_REG_RST_EN_L1_I0_CACHE_V << HP_SYS_CLKRST_REG_RST_EN_L1_I0_CACHE_S)
#define HP_SYS_CLKRST_REG_RST_EN_L1_I0_CACHE_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_L1_I0_CACHE_S  13
/** HP_SYS_CLKRST_REG_RST_EN_L1_I1_CACHE : R/W; bitpos: [14]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_L1_I1_CACHE    (BIT(14))
#define HP_SYS_CLKRST_REG_RST_EN_L1_I1_CACHE_M  (HP_SYS_CLKRST_REG_RST_EN_L1_I1_CACHE_V << HP_SYS_CLKRST_REG_RST_EN_L1_I1_CACHE_S)
#define HP_SYS_CLKRST_REG_RST_EN_L1_I1_CACHE_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_L1_I1_CACHE_S  14
/** HP_SYS_CLKRST_REG_RST_EN_L1_D_CACHE : R/W; bitpos: [15]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_L1_D_CACHE    (BIT(15))
#define HP_SYS_CLKRST_REG_RST_EN_L1_D_CACHE_M  (HP_SYS_CLKRST_REG_RST_EN_L1_D_CACHE_V << HP_SYS_CLKRST_REG_RST_EN_L1_D_CACHE_S)
#define HP_SYS_CLKRST_REG_RST_EN_L1_D_CACHE_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_L1_D_CACHE_S  15
/** HP_SYS_CLKRST_REG_RST_EN_L2_CACHE : R/W; bitpos: [16]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_L2_CACHE    (BIT(16))
#define HP_SYS_CLKRST_REG_RST_EN_L2_CACHE_M  (HP_SYS_CLKRST_REG_RST_EN_L2_CACHE_V << HP_SYS_CLKRST_REG_RST_EN_L2_CACHE_S)
#define HP_SYS_CLKRST_REG_RST_EN_L2_CACHE_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_L2_CACHE_S  16
/** HP_SYS_CLKRST_REG_RST_EN_L2_MEM : R/W; bitpos: [17]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_L2_MEM    (BIT(17))
#define HP_SYS_CLKRST_REG_RST_EN_L2_MEM_M  (HP_SYS_CLKRST_REG_RST_EN_L2_MEM_V << HP_SYS_CLKRST_REG_RST_EN_L2_MEM_S)
#define HP_SYS_CLKRST_REG_RST_EN_L2_MEM_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_L2_MEM_S  17
/** HP_SYS_CLKRST_REG_RST_EN_L2MEMMON : R/W; bitpos: [18]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_L2MEMMON    (BIT(18))
#define HP_SYS_CLKRST_REG_RST_EN_L2MEMMON_M  (HP_SYS_CLKRST_REG_RST_EN_L2MEMMON_V << HP_SYS_CLKRST_REG_RST_EN_L2MEMMON_S)
#define HP_SYS_CLKRST_REG_RST_EN_L2MEMMON_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_L2MEMMON_S  18
/** HP_SYS_CLKRST_REG_RST_EN_TCMMON : R/W; bitpos: [19]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_TCMMON    (BIT(19))
#define HP_SYS_CLKRST_REG_RST_EN_TCMMON_M  (HP_SYS_CLKRST_REG_RST_EN_TCMMON_V << HP_SYS_CLKRST_REG_RST_EN_TCMMON_S)
#define HP_SYS_CLKRST_REG_RST_EN_TCMMON_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_TCMMON_S  19
/** HP_SYS_CLKRST_REG_RST_EN_PVT_APB : R/W; bitpos: [20]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_PVT_APB    (BIT(20))
#define HP_SYS_CLKRST_REG_RST_EN_PVT_APB_M  (HP_SYS_CLKRST_REG_RST_EN_PVT_APB_V << HP_SYS_CLKRST_REG_RST_EN_PVT_APB_S)
#define HP_SYS_CLKRST_REG_RST_EN_PVT_APB_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_PVT_APB_S  20
/** HP_SYS_CLKRST_REG_RST_EN_GDMA : R/W; bitpos: [21]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_GDMA    (BIT(21))
#define HP_SYS_CLKRST_REG_RST_EN_GDMA_M  (HP_SYS_CLKRST_REG_RST_EN_GDMA_V << HP_SYS_CLKRST_REG_RST_EN_GDMA_S)
#define HP_SYS_CLKRST_REG_RST_EN_GDMA_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_GDMA_S  21
/** HP_SYS_CLKRST_REG_RST_EN_MSPI_AXI : R/W; bitpos: [22]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_MSPI_AXI    (BIT(22))
#define HP_SYS_CLKRST_REG_RST_EN_MSPI_AXI_M  (HP_SYS_CLKRST_REG_RST_EN_MSPI_AXI_V << HP_SYS_CLKRST_REG_RST_EN_MSPI_AXI_S)
#define HP_SYS_CLKRST_REG_RST_EN_MSPI_AXI_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_MSPI_AXI_S  22
/** HP_SYS_CLKRST_REG_RST_EN_DUAL_MSPI_AXI : R/W; bitpos: [23]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_DUAL_MSPI_AXI    (BIT(23))
#define HP_SYS_CLKRST_REG_RST_EN_DUAL_MSPI_AXI_M  (HP_SYS_CLKRST_REG_RST_EN_DUAL_MSPI_AXI_V << HP_SYS_CLKRST_REG_RST_EN_DUAL_MSPI_AXI_S)
#define HP_SYS_CLKRST_REG_RST_EN_DUAL_MSPI_AXI_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_DUAL_MSPI_AXI_S  23
/** HP_SYS_CLKRST_REG_RST_EN_MSPI_APB : R/W; bitpos: [24]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_MSPI_APB    (BIT(24))
#define HP_SYS_CLKRST_REG_RST_EN_MSPI_APB_M  (HP_SYS_CLKRST_REG_RST_EN_MSPI_APB_V << HP_SYS_CLKRST_REG_RST_EN_MSPI_APB_S)
#define HP_SYS_CLKRST_REG_RST_EN_MSPI_APB_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_MSPI_APB_S  24
/** HP_SYS_CLKRST_REG_RST_EN_DUAL_MSPI_APB : R/W; bitpos: [25]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_DUAL_MSPI_APB    (BIT(25))
#define HP_SYS_CLKRST_REG_RST_EN_DUAL_MSPI_APB_M  (HP_SYS_CLKRST_REG_RST_EN_DUAL_MSPI_APB_V << HP_SYS_CLKRST_REG_RST_EN_DUAL_MSPI_APB_S)
#define HP_SYS_CLKRST_REG_RST_EN_DUAL_MSPI_APB_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_DUAL_MSPI_APB_S  25
/** HP_SYS_CLKRST_REG_RST_EN_DSI_BRG : R/W; bitpos: [26]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_DSI_BRG    (BIT(26))
#define HP_SYS_CLKRST_REG_RST_EN_DSI_BRG_M  (HP_SYS_CLKRST_REG_RST_EN_DSI_BRG_V << HP_SYS_CLKRST_REG_RST_EN_DSI_BRG_S)
#define HP_SYS_CLKRST_REG_RST_EN_DSI_BRG_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_DSI_BRG_S  26
/** HP_SYS_CLKRST_REG_RST_EN_CSI_HOST : R/W; bitpos: [27]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_CSI_HOST    (BIT(27))
#define HP_SYS_CLKRST_REG_RST_EN_CSI_HOST_M  (HP_SYS_CLKRST_REG_RST_EN_CSI_HOST_V << HP_SYS_CLKRST_REG_RST_EN_CSI_HOST_S)
#define HP_SYS_CLKRST_REG_RST_EN_CSI_HOST_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_CSI_HOST_S  27
/** HP_SYS_CLKRST_REG_RST_EN_CSI_BRG : R/W; bitpos: [28]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_CSI_BRG    (BIT(28))
#define HP_SYS_CLKRST_REG_RST_EN_CSI_BRG_M  (HP_SYS_CLKRST_REG_RST_EN_CSI_BRG_V << HP_SYS_CLKRST_REG_RST_EN_CSI_BRG_S)
#define HP_SYS_CLKRST_REG_RST_EN_CSI_BRG_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_CSI_BRG_S  28
/** HP_SYS_CLKRST_REG_RST_EN_ISP : R/W; bitpos: [29]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_ISP    (BIT(29))
#define HP_SYS_CLKRST_REG_RST_EN_ISP_M  (HP_SYS_CLKRST_REG_RST_EN_ISP_V << HP_SYS_CLKRST_REG_RST_EN_ISP_S)
#define HP_SYS_CLKRST_REG_RST_EN_ISP_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_ISP_S  29
/** HP_SYS_CLKRST_REG_RST_EN_JPEG : R/W; bitpos: [30]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_JPEG    (BIT(30))
#define HP_SYS_CLKRST_REG_RST_EN_JPEG_M  (HP_SYS_CLKRST_REG_RST_EN_JPEG_V << HP_SYS_CLKRST_REG_RST_EN_JPEG_S)
#define HP_SYS_CLKRST_REG_RST_EN_JPEG_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_JPEG_S  30
/** HP_SYS_CLKRST_REG_RST_EN_DMA2D : R/W; bitpos: [31]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_DMA2D    (BIT(31))
#define HP_SYS_CLKRST_REG_RST_EN_DMA2D_M  (HP_SYS_CLKRST_REG_RST_EN_DMA2D_V << HP_SYS_CLKRST_REG_RST_EN_DMA2D_S)
#define HP_SYS_CLKRST_REG_RST_EN_DMA2D_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_DMA2D_S  31

