espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/hp_sys_clkrst_reg.h
/** HP_SYS_CLKRST_HP_RST_EN1_REG register
 *  Reserved
 */
#define HP_SYS_CLKRST_HP_RST_EN1_REG (DR_REG_HP_SYS_CLKRST_BASE + 0xc4)
/** HP_SYS_CLKRST_REG_RST_EN_PPA : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_PPA    (BIT(0))
#define HP_SYS_CLKRST_REG_RST_EN_PPA_M  (HP_SYS_CLKRST_REG_RST_EN_PPA_V << HP_SYS_CLKRST_REG_RST_EN_PPA_S)
#define HP_SYS_CLKRST_REG_RST_EN_PPA_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_PPA_S  0
/** HP_SYS_CLKRST_REG_RST_EN_AHB_PDMA : R/W; bitpos: [1]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_AHB_PDMA    (BIT(1))
#define HP_SYS_CLKRST_REG_RST_EN_AHB_PDMA_M  (HP_SYS_CLKRST_REG_RST_EN_AHB_PDMA_V << HP_SYS_CLKRST_REG_RST_EN_AHB_PDMA_S)
#define HP_SYS_CLKRST_REG_RST_EN_AHB_PDMA_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_AHB_PDMA_S  1
/** HP_SYS_CLKRST_REG_RST_EN_AXI_PDMA : R/W; bitpos: [2]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_AXI_PDMA    (BIT(2))
#define HP_SYS_CLKRST_REG_RST_EN_AXI_PDMA_M  (HP_SYS_CLKRST_REG_RST_EN_AXI_PDMA_V << HP_SYS_CLKRST_REG_RST_EN_AXI_PDMA_S)
#define HP_SYS_CLKRST_REG_RST_EN_AXI_PDMA_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_AXI_PDMA_S  2
/** HP_SYS_CLKRST_REG_RST_EN_IOMUX : R/W; bitpos: [3]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_IOMUX    (BIT(3))
#define HP_SYS_CLKRST_REG_RST_EN_IOMUX_M  (HP_SYS_CLKRST_REG_RST_EN_IOMUX_V << HP_SYS_CLKRST_REG_RST_EN_IOMUX_S)
#define HP_SYS_CLKRST_REG_RST_EN_IOMUX_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_IOMUX_S  3
/** HP_SYS_CLKRST_REG_RST_EN_PADBIST : R/W; bitpos: [4]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_PADBIST    (BIT(4))
#define HP_SYS_CLKRST_REG_RST_EN_PADBIST_M  (HP_SYS_CLKRST_REG_RST_EN_PADBIST_V << HP_SYS_CLKRST_REG_RST_EN_PADBIST_S)
#define HP_SYS_CLKRST_REG_RST_EN_PADBIST_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_PADBIST_S  4
/** HP_SYS_CLKRST_REG_RST_EN_STIMER : R/W; bitpos: [5]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_STIMER    (BIT(5))
#define HP_SYS_CLKRST_REG_RST_EN_STIMER_M  (HP_SYS_CLKRST_REG_RST_EN_STIMER_V << HP_SYS_CLKRST_REG_RST_EN_STIMER_S)
#define HP_SYS_CLKRST_REG_RST_EN_STIMER_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_STIMER_S  5
/** HP_SYS_CLKRST_REG_RST_EN_TIMERGRP0 : R/W; bitpos: [6]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_TIMERGRP0    (BIT(6))
#define HP_SYS_CLKRST_REG_RST_EN_TIMERGRP0_M  (HP_SYS_CLKRST_REG_RST_EN_TIMERGRP0_V << HP_SYS_CLKRST_REG_RST_EN_TIMERGRP0_S)
#define HP_SYS_CLKRST_REG_RST_EN_TIMERGRP0_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_TIMERGRP0_S  6
/** HP_SYS_CLKRST_REG_RST_EN_TIMERGRP1 : R/W; bitpos: [7]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_TIMERGRP1    (BIT(7))
#define HP_SYS_CLKRST_REG_RST_EN_TIMERGRP1_M  (HP_SYS_CLKRST_REG_RST_EN_TIMERGRP1_V << HP_SYS_CLKRST_REG_RST_EN_TIMERGRP1_S)
#define HP_SYS_CLKRST_REG_RST_EN_TIMERGRP1_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_TIMERGRP1_S  7
/** HP_SYS_CLKRST_REG_RST_EN_UART0_CORE : R/W; bitpos: [8]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_UART0_CORE    (BIT(8))
#define HP_SYS_CLKRST_REG_RST_EN_UART0_CORE_M  (HP_SYS_CLKRST_REG_RST_EN_UART0_CORE_V << HP_SYS_CLKRST_REG_RST_EN_UART0_CORE_S)
#define HP_SYS_CLKRST_REG_RST_EN_UART0_CORE_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_UART0_CORE_S  8
/** HP_SYS_CLKRST_REG_RST_EN_UART1_CORE : R/W; bitpos: [9]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_UART1_CORE    (BIT(9))
#define HP_SYS_CLKRST_REG_RST_EN_UART1_CORE_M  (HP_SYS_CLKRST_REG_RST_EN_UART1_CORE_V << HP_SYS_CLKRST_REG_RST_EN_UART1_CORE_S)
#define HP_SYS_CLKRST_REG_RST_EN_UART1_CORE_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_UART1_CORE_S  9
/** HP_SYS_CLKRST_REG_RST_EN_UART2_CORE : R/W; bitpos: [10]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_UART2_CORE    (BIT(10))
#define HP_SYS_CLKRST_REG_RST_EN_UART2_CORE_M  (HP_SYS_CLKRST_REG_RST_EN_UART2_CORE_V << HP_SYS_CLKRST_REG_RST_EN_UART2_CORE_S)
#define HP_SYS_CLKRST_REG_RST_EN_UART2_CORE_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_UART2_CORE_S  10
/** HP_SYS_CLKRST_REG_RST_EN_UART3_CORE : R/W; bitpos: [11]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_UART3_CORE    (BIT(11))
#define HP_SYS_CLKRST_REG_RST_EN_UART3_CORE_M  (HP_SYS_CLKRST_REG_RST_EN_UART3_CORE_V << HP_SYS_CLKRST_REG_RST_EN_UART3_CORE_S)
#define HP_SYS_CLKRST_REG_RST_EN_UART3_CORE_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_UART3_CORE_S  11
/** HP_SYS_CLKRST_REG_RST_EN_UART4_CORE : R/W; bitpos: [12]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_UART4_CORE    (BIT(12))
#define HP_SYS_CLKRST_REG_RST_EN_UART4_CORE_M  (HP_SYS_CLKRST_REG_RST_EN_UART4_CORE_V << HP_SYS_CLKRST_REG_RST_EN_UART4_CORE_S)
#define HP_SYS_CLKRST_REG_RST_EN_UART4_CORE_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_UART4_CORE_S  12
/** HP_SYS_CLKRST_REG_RST_EN_UART0_APB : R/W; bitpos: [13]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_UART0_APB    (BIT(13))
#define HP_SYS_CLKRST_REG_RST_EN_UART0_APB_M  (HP_SYS_CLKRST_REG_RST_EN_UART0_APB_V << HP_SYS_CLKRST_REG_RST_EN_UART0_APB_S)
#define HP_SYS_CLKRST_REG_RST_EN_UART0_APB_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_UART0_APB_S  13
/** HP_SYS_CLKRST_REG_RST_EN_UART1_APB : R/W; bitpos: [14]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_UART1_APB    (BIT(14))
#define HP_SYS_CLKRST_REG_RST_EN_UART1_APB_M  (HP_SYS_CLKRST_REG_RST_EN_UART1_APB_V << HP_SYS_CLKRST_REG_RST_EN_UART1_APB_S)
#define HP_SYS_CLKRST_REG_RST_EN_UART1_APB_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_UART1_APB_S  14
/** HP_SYS_CLKRST_REG_RST_EN_UART2_APB : R/W; bitpos: [15]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_UART2_APB    (BIT(15))
#define HP_SYS_CLKRST_REG_RST_EN_UART2_APB_M  (HP_SYS_CLKRST_REG_RST_EN_UART2_APB_V << HP_SYS_CLKRST_REG_RST_EN_UART2_APB_S)
#define HP_SYS_CLKRST_REG_RST_EN_UART2_APB_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_UART2_APB_S  15
/** HP_SYS_CLKRST_REG_RST_EN_UART3_APB : R/W; bitpos: [16]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_UART3_APB    (BIT(16))
#define HP_SYS_CLKRST_REG_RST_EN_UART3_APB_M  (HP_SYS_CLKRST_REG_RST_EN_UART3_APB_V << HP_SYS_CLKRST_REG_RST_EN_UART3_APB_S)
#define HP_SYS_CLKRST_REG_RST_EN_UART3_APB_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_UART3_APB_S  16
/** HP_SYS_CLKRST_REG_RST_EN_UART4_APB : R/W; bitpos: [17]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_UART4_APB    (BIT(17))
#define HP_SYS_CLKRST_REG_RST_EN_UART4_APB_M  (HP_SYS_CLKRST_REG_RST_EN_UART4_APB_V << HP_SYS_CLKRST_REG_RST_EN_UART4_APB_S)
#define HP_SYS_CLKRST_REG_RST_EN_UART4_APB_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_UART4_APB_S  17
/** HP_SYS_CLKRST_REG_RST_EN_UHCI : R/W; bitpos: [18]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_UHCI    (BIT(18))
#define HP_SYS_CLKRST_REG_RST_EN_UHCI_M  (HP_SYS_CLKRST_REG_RST_EN_UHCI_V << HP_SYS_CLKRST_REG_RST_EN_UHCI_S)
#define HP_SYS_CLKRST_REG_RST_EN_UHCI_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_UHCI_S  18
/** HP_SYS_CLKRST_REG_RST_EN_I3CMST : R/W; bitpos: [19]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_I3CMST    (BIT(19))
#define HP_SYS_CLKRST_REG_RST_EN_I3CMST_M  (HP_SYS_CLKRST_REG_RST_EN_I3CMST_V << HP_SYS_CLKRST_REG_RST_EN_I3CMST_S)
#define HP_SYS_CLKRST_REG_RST_EN_I3CMST_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_I3CMST_S  19
/** HP_SYS_CLKRST_REG_RST_EN_I3CSLV : R/W; bitpos: [20]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_I3CSLV    (BIT(20))
#define HP_SYS_CLKRST_REG_RST_EN_I3CSLV_M  (HP_SYS_CLKRST_REG_RST_EN_I3CSLV_V << HP_SYS_CLKRST_REG_RST_EN_I3CSLV_S)
#define HP_SYS_CLKRST_REG_RST_EN_I3CSLV_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_I3CSLV_S  20
/** HP_SYS_CLKRST_REG_RST_EN_I2C1 : R/W; bitpos: [21]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_I2C1    (BIT(21))
#define HP_SYS_CLKRST_REG_RST_EN_I2C1_M  (HP_SYS_CLKRST_REG_RST_EN_I2C1_V << HP_SYS_CLKRST_REG_RST_EN_I2C1_S)
#define HP_SYS_CLKRST_REG_RST_EN_I2C1_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_I2C1_S  21
/** HP_SYS_CLKRST_REG_RST_EN_I2C0 : R/W; bitpos: [22]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_I2C0    (BIT(22))
#define HP_SYS_CLKRST_REG_RST_EN_I2C0_M  (HP_SYS_CLKRST_REG_RST_EN_I2C0_V << HP_SYS_CLKRST_REG_RST_EN_I2C0_S)
#define HP_SYS_CLKRST_REG_RST_EN_I2C0_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_I2C0_S  22
/** HP_SYS_CLKRST_REG_RST_EN_RMT : R/W; bitpos: [23]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_RMT    (BIT(23))
#define HP_SYS_CLKRST_REG_RST_EN_RMT_M  (HP_SYS_CLKRST_REG_RST_EN_RMT_V << HP_SYS_CLKRST_REG_RST_EN_RMT_S)
#define HP_SYS_CLKRST_REG_RST_EN_RMT_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_RMT_S  23
/** HP_SYS_CLKRST_REG_RST_EN_PWM0 : R/W; bitpos: [24]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_PWM0    (BIT(24))
#define HP_SYS_CLKRST_REG_RST_EN_PWM0_M  (HP_SYS_CLKRST_REG_RST_EN_PWM0_V << HP_SYS_CLKRST_REG_RST_EN_PWM0_S)
#define HP_SYS_CLKRST_REG_RST_EN_PWM0_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_PWM0_S  24
/** HP_SYS_CLKRST_REG_RST_EN_PWM1 : R/W; bitpos: [25]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_PWM1    (BIT(25))
#define HP_SYS_CLKRST_REG_RST_EN_PWM1_M  (HP_SYS_CLKRST_REG_RST_EN_PWM1_V << HP_SYS_CLKRST_REG_RST_EN_PWM1_S)
#define HP_SYS_CLKRST_REG_RST_EN_PWM1_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_PWM1_S  25
/** HP_SYS_CLKRST_REG_RST_EN_CAN0 : R/W; bitpos: [26]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_CAN0    (BIT(26))
#define HP_SYS_CLKRST_REG_RST_EN_CAN0_M  (HP_SYS_CLKRST_REG_RST_EN_CAN0_V << HP_SYS_CLKRST_REG_RST_EN_CAN0_S)
#define HP_SYS_CLKRST_REG_RST_EN_CAN0_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_CAN0_S  26
/** HP_SYS_CLKRST_REG_RST_EN_CAN1 : R/W; bitpos: [27]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_CAN1    (BIT(27))
#define HP_SYS_CLKRST_REG_RST_EN_CAN1_M  (HP_SYS_CLKRST_REG_RST_EN_CAN1_V << HP_SYS_CLKRST_REG_RST_EN_CAN1_S)
#define HP_SYS_CLKRST_REG_RST_EN_CAN1_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_CAN1_S  27
/** HP_SYS_CLKRST_REG_RST_EN_CAN2 : R/W; bitpos: [28]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_CAN2    (BIT(28))
#define HP_SYS_CLKRST_REG_RST_EN_CAN2_M  (HP_SYS_CLKRST_REG_RST_EN_CAN2_V << HP_SYS_CLKRST_REG_RST_EN_CAN2_S)
#define HP_SYS_CLKRST_REG_RST_EN_CAN2_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_CAN2_S  28
/** HP_SYS_CLKRST_REG_RST_EN_LEDC : R/W; bitpos: [29]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_LEDC    (BIT(29))
#define HP_SYS_CLKRST_REG_RST_EN_LEDC_M  (HP_SYS_CLKRST_REG_RST_EN_LEDC_V << HP_SYS_CLKRST_REG_RST_EN_LEDC_S)
#define HP_SYS_CLKRST_REG_RST_EN_LEDC_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_LEDC_S  29
/** HP_SYS_CLKRST_REG_RST_EN_PCNT : R/W; bitpos: [30]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_PCNT    (BIT(30))
#define HP_SYS_CLKRST_REG_RST_EN_PCNT_M  (HP_SYS_CLKRST_REG_RST_EN_PCNT_V << HP_SYS_CLKRST_REG_RST_EN_PCNT_S)
#define HP_SYS_CLKRST_REG_RST_EN_PCNT_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_PCNT_S  30
/** HP_SYS_CLKRST_REG_RST_EN_ETM : R/W; bitpos: [31]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_ETM    (BIT(31))
#define HP_SYS_CLKRST_REG_RST_EN_ETM_M  (HP_SYS_CLKRST_REG_RST_EN_ETM_V << HP_SYS_CLKRST_REG_RST_EN_ETM_S)
#define HP_SYS_CLKRST_REG_RST_EN_ETM_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_ETM_S  31

/** HP_SYS_CLKRST_HP_RST_EN2_REG register
 *  Reserved
 */
#define HP_SYS_CLKRST_HP_RST_EN2_REG (DR_REG_HP_SYS_CLKRST_BASE + 0xc8)
/** HP_SYS_CLKRST_REG_RST_EN_INTRMTX : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_INTRMTX    (BIT(0))
#define HP_SYS_CLKRST_REG_RST_EN_INTRMTX_M  (HP_SYS_CLKRST_REG_RST_EN_INTRMTX_V << HP_SYS_CLKRST_REG_RST_EN_INTRMTX_S)
#define HP_SYS_CLKRST_REG_RST_EN_INTRMTX_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_INTRMTX_S  0
/** HP_SYS_CLKRST_REG_RST_EN_PARLIO : R/W; bitpos: [1]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_PARLIO    (BIT(1))
#define HP_SYS_CLKRST_REG_RST_EN_PARLIO_M  (HP_SYS_CLKRST_REG_RST_EN_PARLIO_V << HP_SYS_CLKRST_REG_RST_EN_PARLIO_S)
#define HP_SYS_CLKRST_REG_RST_EN_PARLIO_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_PARLIO_S  1
/** HP_SYS_CLKRST_REG_RST_EN_PARLIO_RX : R/W; bitpos: [2]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_PARLIO_RX    (BIT(2))
#define HP_SYS_CLKRST_REG_RST_EN_PARLIO_RX_M  (HP_SYS_CLKRST_REG_RST_EN_PARLIO_RX_V << HP_SYS_CLKRST_REG_RST_EN_PARLIO_RX_S)
#define HP_SYS_CLKRST_REG_RST_EN_PARLIO_RX_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_PARLIO_RX_S  2
/** HP_SYS_CLKRST_REG_RST_EN_PARLIO_TX : R/W; bitpos: [3]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_PARLIO_TX    (BIT(3))
#define HP_SYS_CLKRST_REG_RST_EN_PARLIO_TX_M  (HP_SYS_CLKRST_REG_RST_EN_PARLIO_TX_V << HP_SYS_CLKRST_REG_RST_EN_PARLIO_TX_S)
#define HP_SYS_CLKRST_REG_RST_EN_PARLIO_TX_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_PARLIO_TX_S  3
/** HP_SYS_CLKRST_REG_RST_EN_I2S0_APB : R/W; bitpos: [4]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_I2S0_APB    (BIT(4))
#define HP_SYS_CLKRST_REG_RST_EN_I2S0_APB_M  (HP_SYS_CLKRST_REG_RST_EN_I2S0_APB_V << HP_SYS_CLKRST_REG_RST_EN_I2S0_APB_S)
#define HP_SYS_CLKRST_REG_RST_EN_I2S0_APB_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_I2S0_APB_S  4
/** HP_SYS_CLKRST_REG_RST_EN_I2S1_APB : R/W; bitpos: [5]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_I2S1_APB    (BIT(5))
#define HP_SYS_CLKRST_REG_RST_EN_I2S1_APB_M  (HP_SYS_CLKRST_REG_RST_EN_I2S1_APB_V << HP_SYS_CLKRST_REG_RST_EN_I2S1_APB_S)
#define HP_SYS_CLKRST_REG_RST_EN_I2S1_APB_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_I2S1_APB_S  5
/** HP_SYS_CLKRST_REG_RST_EN_I2S2_APB : R/W; bitpos: [6]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_I2S2_APB    (BIT(6))
#define HP_SYS_CLKRST_REG_RST_EN_I2S2_APB_M  (HP_SYS_CLKRST_REG_RST_EN_I2S2_APB_V << HP_SYS_CLKRST_REG_RST_EN_I2S2_APB_S)
#define HP_SYS_CLKRST_REG_RST_EN_I2S2_APB_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_I2S2_APB_S  6
/** HP_SYS_CLKRST_REG_RST_EN_SPI2 : R/W; bitpos: [7]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_SPI2    (BIT(7))
#define HP_SYS_CLKRST_REG_RST_EN_SPI2_M  (HP_SYS_CLKRST_REG_RST_EN_SPI2_V << HP_SYS_CLKRST_REG_RST_EN_SPI2_S)
#define HP_SYS_CLKRST_REG_RST_EN_SPI2_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_SPI2_S  7
/** HP_SYS_CLKRST_REG_RST_EN_SPI3 : R/W; bitpos: [8]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_SPI3    (BIT(8))
#define HP_SYS_CLKRST_REG_RST_EN_SPI3_M  (HP_SYS_CLKRST_REG_RST_EN_SPI3_V << HP_SYS_CLKRST_REG_RST_EN_SPI3_S)
#define HP_SYS_CLKRST_REG_RST_EN_SPI3_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_SPI3_S  8
/** HP_SYS_CLKRST_REG_RST_EN_LCDCAM : R/W; bitpos: [9]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_LCDCAM    (BIT(9))
#define HP_SYS_CLKRST_REG_RST_EN_LCDCAM_M  (HP_SYS_CLKRST_REG_RST_EN_LCDCAM_V << HP_SYS_CLKRST_REG_RST_EN_LCDCAM_S)
#define HP_SYS_CLKRST_REG_RST_EN_LCDCAM_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_LCDCAM_S  9
/** HP_SYS_CLKRST_REG_RST_EN_ADC : R/W; bitpos: [10]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_ADC    (BIT(10))
#define HP_SYS_CLKRST_REG_RST_EN_ADC_M  (HP_SYS_CLKRST_REG_RST_EN_ADC_V << HP_SYS_CLKRST_REG_RST_EN_ADC_S)
#define HP_SYS_CLKRST_REG_RST_EN_ADC_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_ADC_S  10
/** HP_SYS_CLKRST_REG_RST_EN_BITSCRAMBLER : R/W; bitpos: [11]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_BITSCRAMBLER    (BIT(11))
#define HP_SYS_CLKRST_REG_RST_EN_BITSCRAMBLER_M  (HP_SYS_CLKRST_REG_RST_EN_BITSCRAMBLER_V << HP_SYS_CLKRST_REG_RST_EN_BITSCRAMBLER_S)
#define HP_SYS_CLKRST_REG_RST_EN_BITSCRAMBLER_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_BITSCRAMBLER_S  11
/** HP_SYS_CLKRST_REG_RST_EN_BITSCRAMBLER_RX : R/W; bitpos: [12]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_BITSCRAMBLER_RX    (BIT(12))
#define HP_SYS_CLKRST_REG_RST_EN_BITSCRAMBLER_RX_M  (HP_SYS_CLKRST_REG_RST_EN_BITSCRAMBLER_RX_V << HP_SYS_CLKRST_REG_RST_EN_BITSCRAMBLER_RX_S)
#define HP_SYS_CLKRST_REG_RST_EN_BITSCRAMBLER_RX_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_BITSCRAMBLER_RX_S  12
/** HP_SYS_CLKRST_REG_RST_EN_BITSCRAMBLER_TX : R/W; bitpos: [13]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_BITSCRAMBLER_TX    (BIT(13))
#define HP_SYS_CLKRST_REG_RST_EN_BITSCRAMBLER_TX_M  (HP_SYS_CLKRST_REG_RST_EN_BITSCRAMBLER_TX_V << HP_SYS_CLKRST_REG_RST_EN_BITSCRAMBLER_TX_S)
#define HP_SYS_CLKRST_REG_RST_EN_BITSCRAMBLER_TX_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_BITSCRAMBLER_TX_S  13
/** HP_SYS_CLKRST_REG_RST_EN_CRYPTO : R/W; bitpos: [14]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_CRYPTO    (BIT(14))
#define HP_SYS_CLKRST_REG_RST_EN_CRYPTO_M  (HP_SYS_CLKRST_REG_RST_EN_CRYPTO_V << HP_SYS_CLKRST_REG_RST_EN_CRYPTO_S)
#define HP_SYS_CLKRST_REG_RST_EN_CRYPTO_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_CRYPTO_S  14
/** HP_SYS_CLKRST_REG_RST_EN_SEC : R/W; bitpos: [15]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_SEC    (BIT(15))
#define HP_SYS_CLKRST_REG_RST_EN_SEC_M  (HP_SYS_CLKRST_REG_RST_EN_SEC_V << HP_SYS_CLKRST_REG_RST_EN_SEC_S)
#define HP_SYS_CLKRST_REG_RST_EN_SEC_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_SEC_S  15
/** HP_SYS_CLKRST_REG_RST_EN_AES : R/W; bitpos: [16]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_AES    (BIT(16))
#define HP_SYS_CLKRST_REG_RST_EN_AES_M  (HP_SYS_CLKRST_REG_RST_EN_AES_V << HP_SYS_CLKRST_REG_RST_EN_AES_S)
#define HP_SYS_CLKRST_REG_RST_EN_AES_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_AES_S  16
/** HP_SYS_CLKRST_REG_RST_EN_DS : R/W; bitpos: [17]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_DS    (BIT(17))
#define HP_SYS_CLKRST_REG_RST_EN_DS_M  (HP_SYS_CLKRST_REG_RST_EN_DS_V << HP_SYS_CLKRST_REG_RST_EN_DS_S)
#define HP_SYS_CLKRST_REG_RST_EN_DS_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_DS_S  17
/** HP_SYS_CLKRST_REG_RST_EN_SHA : R/W; bitpos: [18]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_SHA    (BIT(18))
#define HP_SYS_CLKRST_REG_RST_EN_SHA_M  (HP_SYS_CLKRST_REG_RST_EN_SHA_V << HP_SYS_CLKRST_REG_RST_EN_SHA_S)
#define HP_SYS_CLKRST_REG_RST_EN_SHA_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_SHA_S  18
/** HP_SYS_CLKRST_REG_RST_EN_HMAC : R/W; bitpos: [19]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_HMAC    (BIT(19))
#define HP_SYS_CLKRST_REG_RST_EN_HMAC_M  (HP_SYS_CLKRST_REG_RST_EN_HMAC_V << HP_SYS_CLKRST_REG_RST_EN_HMAC_S)
#define HP_SYS_CLKRST_REG_RST_EN_HMAC_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_HMAC_S  19
/** HP_SYS_CLKRST_REG_RST_EN_ECDSA : R/W; bitpos: [20]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_ECDSA    (BIT(20))
#define HP_SYS_CLKRST_REG_RST_EN_ECDSA_M  (HP_SYS_CLKRST_REG_RST_EN_ECDSA_V << HP_SYS_CLKRST_REG_RST_EN_ECDSA_S)
#define HP_SYS_CLKRST_REG_RST_EN_ECDSA_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_ECDSA_S  20
/** HP_SYS_CLKRST_REG_RST_EN_RSA : R/W; bitpos: [21]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_RSA    (BIT(21))
#define HP_SYS_CLKRST_REG_RST_EN_RSA_M  (HP_SYS_CLKRST_REG_RST_EN_RSA_V << HP_SYS_CLKRST_REG_RST_EN_RSA_S)
#define HP_SYS_CLKRST_REG_RST_EN_RSA_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_RSA_S  21
/** HP_SYS_CLKRST_REG_RST_EN_ECC : R/W; bitpos: [22]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_ECC    (BIT(22))
#define HP_SYS_CLKRST_REG_RST_EN_ECC_M  (HP_SYS_CLKRST_REG_RST_EN_ECC_V << HP_SYS_CLKRST_REG_RST_EN_ECC_S)
#define HP_SYS_CLKRST_REG_RST_EN_ECC_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_ECC_S  22
/** HP_SYS_CLKRST_REG_RST_EN_KM : R/W; bitpos: [23]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_KM    (BIT(23))
#define HP_SYS_CLKRST_REG_RST_EN_KM_M  (HP_SYS_CLKRST_REG_RST_EN_KM_V << HP_SYS_CLKRST_REG_RST_EN_KM_S)
#define HP_SYS_CLKRST_REG_RST_EN_KM_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_KM_S  23
/** HP_SYS_CLKRST_REG_RST_EN_H264 : R/W; bitpos: [24]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_RST_EN_H264    (BIT(24))
#define HP_SYS_CLKRST_REG_RST_EN_H264_M  (HP_SYS_CLKRST_REG_RST_EN_H264_V << HP_SYS_CLKRST_REG_RST_EN_H264_S)
#define HP_SYS_CLKRST_REG_RST_EN_H264_V  0x00000001U
#define HP_SYS_CLKRST_REG_RST_EN_H264_S  24

