espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/hp_sys_clkrst_reg.h
/** HP_SYS_CLKRST_HP_FORCE_NORST0_REG register
 *  Reserved
 */
#define HP_SYS_CLKRST_HP_FORCE_NORST0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0xcc)
/** HP_SYS_CLKRST_REG_FORCE_NORST_CORE0 : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_CORE0    (BIT(0))
#define HP_SYS_CLKRST_REG_FORCE_NORST_CORE0_M  (HP_SYS_CLKRST_REG_FORCE_NORST_CORE0_V << HP_SYS_CLKRST_REG_FORCE_NORST_CORE0_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_CORE0_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_CORE0_S  0
/** HP_SYS_CLKRST_REG_FORCE_NORST_CORE1 : R/W; bitpos: [1]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_CORE1    (BIT(1))
#define HP_SYS_CLKRST_REG_FORCE_NORST_CORE1_M  (HP_SYS_CLKRST_REG_FORCE_NORST_CORE1_V << HP_SYS_CLKRST_REG_FORCE_NORST_CORE1_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_CORE1_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_CORE1_S  1
/** HP_SYS_CLKRST_REG_FORCE_NORST_CORETRACE0 : R/W; bitpos: [2]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_CORETRACE0    (BIT(2))
#define HP_SYS_CLKRST_REG_FORCE_NORST_CORETRACE0_M  (HP_SYS_CLKRST_REG_FORCE_NORST_CORETRACE0_V << HP_SYS_CLKRST_REG_FORCE_NORST_CORETRACE0_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_CORETRACE0_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_CORETRACE0_S  2
/** HP_SYS_CLKRST_REG_FORCE_NORST_CORETRACE1 : R/W; bitpos: [3]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_CORETRACE1    (BIT(3))
#define HP_SYS_CLKRST_REG_FORCE_NORST_CORETRACE1_M  (HP_SYS_CLKRST_REG_FORCE_NORST_CORETRACE1_V << HP_SYS_CLKRST_REG_FORCE_NORST_CORETRACE1_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_CORETRACE1_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_CORETRACE1_S  3
/** HP_SYS_CLKRST_REG_FORCE_NORST_L2MEMMON : R/W; bitpos: [4]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_L2MEMMON    (BIT(4))
#define HP_SYS_CLKRST_REG_FORCE_NORST_L2MEMMON_M  (HP_SYS_CLKRST_REG_FORCE_NORST_L2MEMMON_V << HP_SYS_CLKRST_REG_FORCE_NORST_L2MEMMON_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_L2MEMMON_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_L2MEMMON_S  4
/** HP_SYS_CLKRST_REG_FORCE_NORST_TCMMON : R/W; bitpos: [5]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_TCMMON    (BIT(5))
#define HP_SYS_CLKRST_REG_FORCE_NORST_TCMMON_M  (HP_SYS_CLKRST_REG_FORCE_NORST_TCMMON_V << HP_SYS_CLKRST_REG_FORCE_NORST_TCMMON_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_TCMMON_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_TCMMON_S  5
/** HP_SYS_CLKRST_REG_FORCE_NORST_GDMA : R/W; bitpos: [6]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_GDMA    (BIT(6))
#define HP_SYS_CLKRST_REG_FORCE_NORST_GDMA_M  (HP_SYS_CLKRST_REG_FORCE_NORST_GDMA_V << HP_SYS_CLKRST_REG_FORCE_NORST_GDMA_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_GDMA_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_GDMA_S  6
/** HP_SYS_CLKRST_REG_FORCE_NORST_MSPI_AXI : R/W; bitpos: [7]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_MSPI_AXI    (BIT(7))
#define HP_SYS_CLKRST_REG_FORCE_NORST_MSPI_AXI_M  (HP_SYS_CLKRST_REG_FORCE_NORST_MSPI_AXI_V << HP_SYS_CLKRST_REG_FORCE_NORST_MSPI_AXI_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_MSPI_AXI_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_MSPI_AXI_S  7
/** HP_SYS_CLKRST_REG_FORCE_NORST_DUAL_MSPI_AXI : R/W; bitpos: [8]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_DUAL_MSPI_AXI    (BIT(8))
#define HP_SYS_CLKRST_REG_FORCE_NORST_DUAL_MSPI_AXI_M  (HP_SYS_CLKRST_REG_FORCE_NORST_DUAL_MSPI_AXI_V << HP_SYS_CLKRST_REG_FORCE_NORST_DUAL_MSPI_AXI_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_DUAL_MSPI_AXI_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_DUAL_MSPI_AXI_S  8
/** HP_SYS_CLKRST_REG_FORCE_NORST_MSPI_APB : R/W; bitpos: [9]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_MSPI_APB    (BIT(9))
#define HP_SYS_CLKRST_REG_FORCE_NORST_MSPI_APB_M  (HP_SYS_CLKRST_REG_FORCE_NORST_MSPI_APB_V << HP_SYS_CLKRST_REG_FORCE_NORST_MSPI_APB_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_MSPI_APB_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_MSPI_APB_S  9
/** HP_SYS_CLKRST_REG_FORCE_NORST_DUAL_MSPI_APB : R/W; bitpos: [10]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_DUAL_MSPI_APB    (BIT(10))
#define HP_SYS_CLKRST_REG_FORCE_NORST_DUAL_MSPI_APB_M  (HP_SYS_CLKRST_REG_FORCE_NORST_DUAL_MSPI_APB_V << HP_SYS_CLKRST_REG_FORCE_NORST_DUAL_MSPI_APB_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_DUAL_MSPI_APB_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_DUAL_MSPI_APB_S  10
/** HP_SYS_CLKRST_REG_FORCE_NORST_DSI_BRG : R/W; bitpos: [11]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_DSI_BRG    (BIT(11))
#define HP_SYS_CLKRST_REG_FORCE_NORST_DSI_BRG_M  (HP_SYS_CLKRST_REG_FORCE_NORST_DSI_BRG_V << HP_SYS_CLKRST_REG_FORCE_NORST_DSI_BRG_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_DSI_BRG_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_DSI_BRG_S  11
/** HP_SYS_CLKRST_REG_FORCE_NORST_CSI_HOST : R/W; bitpos: [12]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_CSI_HOST    (BIT(12))
#define HP_SYS_CLKRST_REG_FORCE_NORST_CSI_HOST_M  (HP_SYS_CLKRST_REG_FORCE_NORST_CSI_HOST_V << HP_SYS_CLKRST_REG_FORCE_NORST_CSI_HOST_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_CSI_HOST_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_CSI_HOST_S  12
/** HP_SYS_CLKRST_REG_FORCE_NORST_CSI_BRG : R/W; bitpos: [13]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_CSI_BRG    (BIT(13))
#define HP_SYS_CLKRST_REG_FORCE_NORST_CSI_BRG_M  (HP_SYS_CLKRST_REG_FORCE_NORST_CSI_BRG_V << HP_SYS_CLKRST_REG_FORCE_NORST_CSI_BRG_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_CSI_BRG_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_CSI_BRG_S  13
/** HP_SYS_CLKRST_REG_FORCE_NORST_ISP : R/W; bitpos: [14]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_ISP    (BIT(14))
#define HP_SYS_CLKRST_REG_FORCE_NORST_ISP_M  (HP_SYS_CLKRST_REG_FORCE_NORST_ISP_V << HP_SYS_CLKRST_REG_FORCE_NORST_ISP_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_ISP_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_ISP_S  14
/** HP_SYS_CLKRST_REG_FORCE_NORST_JPEG : R/W; bitpos: [15]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_JPEG    (BIT(15))
#define HP_SYS_CLKRST_REG_FORCE_NORST_JPEG_M  (HP_SYS_CLKRST_REG_FORCE_NORST_JPEG_V << HP_SYS_CLKRST_REG_FORCE_NORST_JPEG_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_JPEG_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_JPEG_S  15
/** HP_SYS_CLKRST_REG_FORCE_NORST_DMA2D : R/W; bitpos: [16]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_DMA2D    (BIT(16))
#define HP_SYS_CLKRST_REG_FORCE_NORST_DMA2D_M  (HP_SYS_CLKRST_REG_FORCE_NORST_DMA2D_V << HP_SYS_CLKRST_REG_FORCE_NORST_DMA2D_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_DMA2D_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_DMA2D_S  16
/** HP_SYS_CLKRST_REG_FORCE_NORST_PPA : R/W; bitpos: [17]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_PPA    (BIT(17))
#define HP_SYS_CLKRST_REG_FORCE_NORST_PPA_M  (HP_SYS_CLKRST_REG_FORCE_NORST_PPA_V << HP_SYS_CLKRST_REG_FORCE_NORST_PPA_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_PPA_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_PPA_S  17
/** HP_SYS_CLKRST_REG_FORCE_NORST_AHB_PDMA : R/W; bitpos: [18]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_AHB_PDMA    (BIT(18))
#define HP_SYS_CLKRST_REG_FORCE_NORST_AHB_PDMA_M  (HP_SYS_CLKRST_REG_FORCE_NORST_AHB_PDMA_V << HP_SYS_CLKRST_REG_FORCE_NORST_AHB_PDMA_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_AHB_PDMA_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_AHB_PDMA_S  18
/** HP_SYS_CLKRST_REG_FORCE_NORST_AXI_PDMA : R/W; bitpos: [19]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_AXI_PDMA    (BIT(19))
#define HP_SYS_CLKRST_REG_FORCE_NORST_AXI_PDMA_M  (HP_SYS_CLKRST_REG_FORCE_NORST_AXI_PDMA_V << HP_SYS_CLKRST_REG_FORCE_NORST_AXI_PDMA_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_AXI_PDMA_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_AXI_PDMA_S  19
/** HP_SYS_CLKRST_REG_FORCE_NORST_IOMUX : R/W; bitpos: [20]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_IOMUX    (BIT(20))
#define HP_SYS_CLKRST_REG_FORCE_NORST_IOMUX_M  (HP_SYS_CLKRST_REG_FORCE_NORST_IOMUX_V << HP_SYS_CLKRST_REG_FORCE_NORST_IOMUX_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_IOMUX_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_IOMUX_S  20
/** HP_SYS_CLKRST_REG_FORCE_NORST_PADBIST : R/W; bitpos: [21]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_PADBIST    (BIT(21))
#define HP_SYS_CLKRST_REG_FORCE_NORST_PADBIST_M  (HP_SYS_CLKRST_REG_FORCE_NORST_PADBIST_V << HP_SYS_CLKRST_REG_FORCE_NORST_PADBIST_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_PADBIST_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_PADBIST_S  21
/** HP_SYS_CLKRST_REG_FORCE_NORST_STIMER : R/W; bitpos: [22]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_STIMER    (BIT(22))
#define HP_SYS_CLKRST_REG_FORCE_NORST_STIMER_M  (HP_SYS_CLKRST_REG_FORCE_NORST_STIMER_V << HP_SYS_CLKRST_REG_FORCE_NORST_STIMER_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_STIMER_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_STIMER_S  22
/** HP_SYS_CLKRST_REG_FORCE_NORST_TIMERGRP0 : R/W; bitpos: [23]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_TIMERGRP0    (BIT(23))
#define HP_SYS_CLKRST_REG_FORCE_NORST_TIMERGRP0_M  (HP_SYS_CLKRST_REG_FORCE_NORST_TIMERGRP0_V << HP_SYS_CLKRST_REG_FORCE_NORST_TIMERGRP0_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_TIMERGRP0_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_TIMERGRP0_S  23
/** HP_SYS_CLKRST_REG_FORCE_NORST_TIMERGRP1 : R/W; bitpos: [24]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_TIMERGRP1    (BIT(24))
#define HP_SYS_CLKRST_REG_FORCE_NORST_TIMERGRP1_M  (HP_SYS_CLKRST_REG_FORCE_NORST_TIMERGRP1_V << HP_SYS_CLKRST_REG_FORCE_NORST_TIMERGRP1_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_TIMERGRP1_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_TIMERGRP1_S  24
/** HP_SYS_CLKRST_REG_FORCE_NORST_UART0 : R/W; bitpos: [25]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_UART0    (BIT(25))
#define HP_SYS_CLKRST_REG_FORCE_NORST_UART0_M  (HP_SYS_CLKRST_REG_FORCE_NORST_UART0_V << HP_SYS_CLKRST_REG_FORCE_NORST_UART0_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_UART0_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_UART0_S  25
/** HP_SYS_CLKRST_REG_FORCE_NORST_UART1 : R/W; bitpos: [26]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_UART1    (BIT(26))
#define HP_SYS_CLKRST_REG_FORCE_NORST_UART1_M  (HP_SYS_CLKRST_REG_FORCE_NORST_UART1_V << HP_SYS_CLKRST_REG_FORCE_NORST_UART1_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_UART1_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_UART1_S  26
/** HP_SYS_CLKRST_REG_FORCE_NORST_UART2 : R/W; bitpos: [27]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_UART2    (BIT(27))
#define HP_SYS_CLKRST_REG_FORCE_NORST_UART2_M  (HP_SYS_CLKRST_REG_FORCE_NORST_UART2_V << HP_SYS_CLKRST_REG_FORCE_NORST_UART2_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_UART2_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_UART2_S  27
/** HP_SYS_CLKRST_REG_FORCE_NORST_UART3 : R/W; bitpos: [28]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_UART3    (BIT(28))
#define HP_SYS_CLKRST_REG_FORCE_NORST_UART3_M  (HP_SYS_CLKRST_REG_FORCE_NORST_UART3_V << HP_SYS_CLKRST_REG_FORCE_NORST_UART3_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_UART3_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_UART3_S  28
/** HP_SYS_CLKRST_REG_FORCE_NORST_UART4 : R/W; bitpos: [29]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_UART4    (BIT(29))
#define HP_SYS_CLKRST_REG_FORCE_NORST_UART4_M  (HP_SYS_CLKRST_REG_FORCE_NORST_UART4_V << HP_SYS_CLKRST_REG_FORCE_NORST_UART4_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_UART4_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_UART4_S  29
/** HP_SYS_CLKRST_REG_FORCE_NORST_UHCI : R/W; bitpos: [30]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_UHCI    (BIT(30))
#define HP_SYS_CLKRST_REG_FORCE_NORST_UHCI_M  (HP_SYS_CLKRST_REG_FORCE_NORST_UHCI_V << HP_SYS_CLKRST_REG_FORCE_NORST_UHCI_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_UHCI_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_UHCI_S  30
/** HP_SYS_CLKRST_REG_FORCE_NORST_I3CMST : R/W; bitpos: [31]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_I3CMST    (BIT(31))
#define HP_SYS_CLKRST_REG_FORCE_NORST_I3CMST_M  (HP_SYS_CLKRST_REG_FORCE_NORST_I3CMST_V << HP_SYS_CLKRST_REG_FORCE_NORST_I3CMST_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_I3CMST_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_I3CMST_S  31

/** HP_SYS_CLKRST_HP_FORCE_NORST1_REG register
 *  Reserved
 */
#define HP_SYS_CLKRST_HP_FORCE_NORST1_REG (DR_REG_HP_SYS_CLKRST_BASE + 0xd0)
/** HP_SYS_CLKRST_REG_FORCE_NORST_I3CSLV : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_I3CSLV    (BIT(0))
#define HP_SYS_CLKRST_REG_FORCE_NORST_I3CSLV_M  (HP_SYS_CLKRST_REG_FORCE_NORST_I3CSLV_V << HP_SYS_CLKRST_REG_FORCE_NORST_I3CSLV_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_I3CSLV_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_I3CSLV_S  0
/** HP_SYS_CLKRST_REG_FORCE_NORST_I2C1 : R/W; bitpos: [1]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_I2C1    (BIT(1))
#define HP_SYS_CLKRST_REG_FORCE_NORST_I2C1_M  (HP_SYS_CLKRST_REG_FORCE_NORST_I2C1_V << HP_SYS_CLKRST_REG_FORCE_NORST_I2C1_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_I2C1_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_I2C1_S  1
/** HP_SYS_CLKRST_REG_FORCE_NORST_I2C0 : R/W; bitpos: [2]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_I2C0    (BIT(2))
#define HP_SYS_CLKRST_REG_FORCE_NORST_I2C0_M  (HP_SYS_CLKRST_REG_FORCE_NORST_I2C0_V << HP_SYS_CLKRST_REG_FORCE_NORST_I2C0_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_I2C0_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_I2C0_S  2
/** HP_SYS_CLKRST_REG_FORCE_NORST_RMT : R/W; bitpos: [3]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_RMT    (BIT(3))
#define HP_SYS_CLKRST_REG_FORCE_NORST_RMT_M  (HP_SYS_CLKRST_REG_FORCE_NORST_RMT_V << HP_SYS_CLKRST_REG_FORCE_NORST_RMT_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_RMT_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_RMT_S  3
/** HP_SYS_CLKRST_REG_FORCE_NORST_PWM0 : R/W; bitpos: [4]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_PWM0    (BIT(4))
#define HP_SYS_CLKRST_REG_FORCE_NORST_PWM0_M  (HP_SYS_CLKRST_REG_FORCE_NORST_PWM0_V << HP_SYS_CLKRST_REG_FORCE_NORST_PWM0_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_PWM0_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_PWM0_S  4
/** HP_SYS_CLKRST_REG_FORCE_NORST_PWM1 : R/W; bitpos: [5]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_PWM1    (BIT(5))
#define HP_SYS_CLKRST_REG_FORCE_NORST_PWM1_M  (HP_SYS_CLKRST_REG_FORCE_NORST_PWM1_V << HP_SYS_CLKRST_REG_FORCE_NORST_PWM1_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_PWM1_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_PWM1_S  5
/** HP_SYS_CLKRST_REG_FORCE_NORST_CAN0 : R/W; bitpos: [6]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_CAN0    (BIT(6))
#define HP_SYS_CLKRST_REG_FORCE_NORST_CAN0_M  (HP_SYS_CLKRST_REG_FORCE_NORST_CAN0_V << HP_SYS_CLKRST_REG_FORCE_NORST_CAN0_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_CAN0_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_CAN0_S  6
/** HP_SYS_CLKRST_REG_FORCE_NORST_CAN1 : R/W; bitpos: [7]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_CAN1    (BIT(7))
#define HP_SYS_CLKRST_REG_FORCE_NORST_CAN1_M  (HP_SYS_CLKRST_REG_FORCE_NORST_CAN1_V << HP_SYS_CLKRST_REG_FORCE_NORST_CAN1_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_CAN1_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_CAN1_S  7
/** HP_SYS_CLKRST_REG_FORCE_NORST_CAN2 : R/W; bitpos: [8]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_CAN2    (BIT(8))
#define HP_SYS_CLKRST_REG_FORCE_NORST_CAN2_M  (HP_SYS_CLKRST_REG_FORCE_NORST_CAN2_V << HP_SYS_CLKRST_REG_FORCE_NORST_CAN2_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_CAN2_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_CAN2_S  8
/** HP_SYS_CLKRST_REG_FORCE_NORST_LEDC : R/W; bitpos: [9]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_LEDC    (BIT(9))
#define HP_SYS_CLKRST_REG_FORCE_NORST_LEDC_M  (HP_SYS_CLKRST_REG_FORCE_NORST_LEDC_V << HP_SYS_CLKRST_REG_FORCE_NORST_LEDC_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_LEDC_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_LEDC_S  9
/** HP_SYS_CLKRST_REG_FORCE_NORST_PCNT : R/W; bitpos: [10]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_PCNT    (BIT(10))
#define HP_SYS_CLKRST_REG_FORCE_NORST_PCNT_M  (HP_SYS_CLKRST_REG_FORCE_NORST_PCNT_V << HP_SYS_CLKRST_REG_FORCE_NORST_PCNT_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_PCNT_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_PCNT_S  10
/** HP_SYS_CLKRST_REG_FORCE_NORST_ETM : R/W; bitpos: [11]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_ETM    (BIT(11))
#define HP_SYS_CLKRST_REG_FORCE_NORST_ETM_M  (HP_SYS_CLKRST_REG_FORCE_NORST_ETM_V << HP_SYS_CLKRST_REG_FORCE_NORST_ETM_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_ETM_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_ETM_S  11
/** HP_SYS_CLKRST_REG_FORCE_NORST_INTRMTX : R/W; bitpos: [12]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_INTRMTX    (BIT(12))
#define HP_SYS_CLKRST_REG_FORCE_NORST_INTRMTX_M  (HP_SYS_CLKRST_REG_FORCE_NORST_INTRMTX_V << HP_SYS_CLKRST_REG_FORCE_NORST_INTRMTX_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_INTRMTX_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_INTRMTX_S  12
/** HP_SYS_CLKRST_REG_FORCE_NORST_PARLIO : R/W; bitpos: [13]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_PARLIO    (BIT(13))
#define HP_SYS_CLKRST_REG_FORCE_NORST_PARLIO_M  (HP_SYS_CLKRST_REG_FORCE_NORST_PARLIO_V << HP_SYS_CLKRST_REG_FORCE_NORST_PARLIO_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_PARLIO_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_PARLIO_S  13
/** HP_SYS_CLKRST_REG_FORCE_NORST_PARLIO_RX : R/W; bitpos: [14]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_PARLIO_RX    (BIT(14))
#define HP_SYS_CLKRST_REG_FORCE_NORST_PARLIO_RX_M  (HP_SYS_CLKRST_REG_FORCE_NORST_PARLIO_RX_V << HP_SYS_CLKRST_REG_FORCE_NORST_PARLIO_RX_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_PARLIO_RX_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_PARLIO_RX_S  14
/** HP_SYS_CLKRST_REG_FORCE_NORST_PARLIO_TX : R/W; bitpos: [15]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_PARLIO_TX    (BIT(15))
#define HP_SYS_CLKRST_REG_FORCE_NORST_PARLIO_TX_M  (HP_SYS_CLKRST_REG_FORCE_NORST_PARLIO_TX_V << HP_SYS_CLKRST_REG_FORCE_NORST_PARLIO_TX_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_PARLIO_TX_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_PARLIO_TX_S  15
/** HP_SYS_CLKRST_REG_FORCE_NORST_I2S0 : R/W; bitpos: [16]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_I2S0    (BIT(16))
#define HP_SYS_CLKRST_REG_FORCE_NORST_I2S0_M  (HP_SYS_CLKRST_REG_FORCE_NORST_I2S0_V << HP_SYS_CLKRST_REG_FORCE_NORST_I2S0_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_I2S0_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_I2S0_S  16
/** HP_SYS_CLKRST_REG_FORCE_NORST_I2S1 : R/W; bitpos: [17]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_I2S1    (BIT(17))
#define HP_SYS_CLKRST_REG_FORCE_NORST_I2S1_M  (HP_SYS_CLKRST_REG_FORCE_NORST_I2S1_V << HP_SYS_CLKRST_REG_FORCE_NORST_I2S1_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_I2S1_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_I2S1_S  17
/** HP_SYS_CLKRST_REG_FORCE_NORST_I2S2 : R/W; bitpos: [18]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_I2S2    (BIT(18))
#define HP_SYS_CLKRST_REG_FORCE_NORST_I2S2_M  (HP_SYS_CLKRST_REG_FORCE_NORST_I2S2_V << HP_SYS_CLKRST_REG_FORCE_NORST_I2S2_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_I2S2_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_I2S2_S  18
/** HP_SYS_CLKRST_REG_FORCE_NORST_SPI2 : R/W; bitpos: [19]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_SPI2    (BIT(19))
#define HP_SYS_CLKRST_REG_FORCE_NORST_SPI2_M  (HP_SYS_CLKRST_REG_FORCE_NORST_SPI2_V << HP_SYS_CLKRST_REG_FORCE_NORST_SPI2_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_SPI2_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_SPI2_S  19
/** HP_SYS_CLKRST_REG_FORCE_NORST_SPI3 : R/W; bitpos: [20]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_SPI3    (BIT(20))
#define HP_SYS_CLKRST_REG_FORCE_NORST_SPI3_M  (HP_SYS_CLKRST_REG_FORCE_NORST_SPI3_V << HP_SYS_CLKRST_REG_FORCE_NORST_SPI3_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_SPI3_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_SPI3_S  20
/** HP_SYS_CLKRST_REG_FORCE_NORST_LCDCAM : R/W; bitpos: [21]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_LCDCAM    (BIT(21))
#define HP_SYS_CLKRST_REG_FORCE_NORST_LCDCAM_M  (HP_SYS_CLKRST_REG_FORCE_NORST_LCDCAM_V << HP_SYS_CLKRST_REG_FORCE_NORST_LCDCAM_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_LCDCAM_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_LCDCAM_S  21
/** HP_SYS_CLKRST_REG_FORCE_NORST_ADC : R/W; bitpos: [22]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_ADC    (BIT(22))
#define HP_SYS_CLKRST_REG_FORCE_NORST_ADC_M  (HP_SYS_CLKRST_REG_FORCE_NORST_ADC_V << HP_SYS_CLKRST_REG_FORCE_NORST_ADC_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_ADC_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_ADC_S  22
/** HP_SYS_CLKRST_REG_FORCE_NORST_BITSCRAMBLER : R/W; bitpos: [23]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_BITSCRAMBLER    (BIT(23))
#define HP_SYS_CLKRST_REG_FORCE_NORST_BITSCRAMBLER_M  (HP_SYS_CLKRST_REG_FORCE_NORST_BITSCRAMBLER_V << HP_SYS_CLKRST_REG_FORCE_NORST_BITSCRAMBLER_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_BITSCRAMBLER_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_BITSCRAMBLER_S  23
/** HP_SYS_CLKRST_REG_FORCE_NORST_BITSCRAMBLER_RX : R/W; bitpos: [24]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_BITSCRAMBLER_RX    (BIT(24))
#define HP_SYS_CLKRST_REG_FORCE_NORST_BITSCRAMBLER_RX_M  (HP_SYS_CLKRST_REG_FORCE_NORST_BITSCRAMBLER_RX_V << HP_SYS_CLKRST_REG_FORCE_NORST_BITSCRAMBLER_RX_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_BITSCRAMBLER_RX_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_BITSCRAMBLER_RX_S  24
/** HP_SYS_CLKRST_REG_FORCE_NORST_BITSCRAMBLER_TX : R/W; bitpos: [25]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_BITSCRAMBLER_TX    (BIT(25))
#define HP_SYS_CLKRST_REG_FORCE_NORST_BITSCRAMBLER_TX_M  (HP_SYS_CLKRST_REG_FORCE_NORST_BITSCRAMBLER_TX_V << HP_SYS_CLKRST_REG_FORCE_NORST_BITSCRAMBLER_TX_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_BITSCRAMBLER_TX_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_BITSCRAMBLER_TX_S  25
/** HP_SYS_CLKRST_REG_FORCE_NORST_H264 : R/W; bitpos: [26]; default: 0;
 *  Reserved
 */
#define HP_SYS_CLKRST_REG_FORCE_NORST_H264    (BIT(26))
#define HP_SYS_CLKRST_REG_FORCE_NORST_H264_M  (HP_SYS_CLKRST_REG_FORCE_NORST_H264_V << HP_SYS_CLKRST_REG_FORCE_NORST_H264_S)
#define HP_SYS_CLKRST_REG_FORCE_NORST_H264_V  0x00000001U
#define HP_SYS_CLKRST_REG_FORCE_NORST_H264_S  26

